Python 3.7.3 (v3.7.3:ef4ec6ed12, Mar 25 2019, 22:22:05) [MSC v.1916 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

['10,298,743'] 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

['6,880,546'] 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

['14,411,775'] 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

['16,265,618'] 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

['13,414,484'] 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

['6,879,989'] 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

['4,684,571'] 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

['2,452,245'] 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

['9,135,806'] 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

['2,636,385'] 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

['12,984,692'] 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

['6,975,631'] 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

['11,212,710'] 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

['12,706,819'] 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

['12,324,002'] 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

['12,811,624'] 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

['9,707,581'] 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

['17,615,658'] 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

['12,276,350'] 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

['3,189,091'] 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

['11,567,662'] 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

['7,075,607'] 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

['5,546,823'] 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

['4,720,050'] 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

['8,660,623'] 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

['7,817,654'] 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

['2,310,206'] 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

['6,129,681'] 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

['2,971,475'] 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

['12,189,654'] 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

['5,294,154'] 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

['14,263,578'] 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

['5,653,444'] 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

['2,084,909'] 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

['4,706,158'] 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

['5,063,844'] 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

['1,110,274'] 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

['3,364,712'] 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

['1,593,386'] 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

['2,625,636'] 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

['4,288,908'] 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

['4,452,850'] 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

['11,375,123'] 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

['1,051,710'] 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

['4,113,696'] 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

['7,232,387'] 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

['3,317,196'] 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

['8,666,208'] 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

['4,018,341'] 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

['2,931,897'] 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

['5,317,959'] 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

['446,054'] 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

['5,447,269'] 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

['10,085,093'] 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

['5,661,128'] 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

['2,594,695'] 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

['3,789,553'] 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

['6,044,956'] 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

['3,897,969'] 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

['5,441,020'] 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

['4,015,361'] 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

['6,247,651'] 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

['4,945,484'] 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

['7,166,688'] 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

['4,858,572'] 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

['5,399,327'] 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

['7,258,678'] 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

['1,346,511'] 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

['3,689,325'] 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

['3,566,852'] 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

['7,120,780'] 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

['3,513,114'] 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

['4,598,985'] 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

['3,420,116'] 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

['2,860,786'] 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

['7,150,586'] 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

['1,441,990'] 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

['4,881,865'] 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

['3,849,700'] 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

['9,001,679'] 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

['10,494,840'] 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

['7,073,516'] 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

['2,812,427'] 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

['3,601,434'] 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

['931,953'] 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

['7,500,457'] 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

['6,592,151'] 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

['3,755,233'] 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

['5,443,232'] 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

['2,625,686'] 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

['2,654,817'] 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

['4,775,811'] 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

['3,888,096'] 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

['5,038,154'] 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

['1,917,999'] 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

['5,311,353'] 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

['6,959,083'] 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

['6,584,915'] 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

['4,969,735'] 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

['3,152,895'] 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

['4,975,517'] 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

['2,718,237'] 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

['963,763'] 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

['5,509,019'] 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

['5,604,106'] 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

['3,611,166'] 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

['9,352,448'] 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

['1,826,912'] 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

['7,759,761'] 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

['2,318,748'] 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

['6,655,068'] 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

['1,128,774'] 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

['5,237,525'] 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

['2,736,060'] 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

['4,131,338'] 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

['1,744,585'] 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

['1,515,356'] 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

['3,450,305'] 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

['8,678,117'] 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

['3,407,564'] 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

['6,126,488'] 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

['3,248,904'] 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

['4,667,179'] 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

['1,864,076'] 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

['10,309,432'] 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

['3,849,129'] 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

['1,094,404'] 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

['1,344,599'] 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

['1,166,025'] 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

['1,462,561'] 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

['4,585,116'] 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

['4,516,063'] 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

['2,982,514'] 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

['461,693'] 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

['3,784,602'] 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

['2,588,628'] 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

['2,564,340'] 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

['1,711,246'] 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

['267,950'] 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

['2,801,949'] 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

['3,117,859'] 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

['3,389,125'] 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

['3,653,238'] 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

['3,984,814'] 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

['1,629,528'] 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

['2,744,413'] 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

['3,240,370'] 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

['5,584,295'] 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

['7,051,237'] 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

['827,338'] 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

['7,508,976'] 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

['608,273'] 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

['988,451'] 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

['2,058,096'] 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

['1,492,903'] 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

['1,646,142'] 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

['1,635,003'] 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

['2,515,590'] 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

['2,138,524'] 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

['4,909,950'] 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

['2,434,435'] 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

['1,974,893'] 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

['2,675,883'] 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

['1,385,511'] 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

['4,853,273'] 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

['1,110,523'] 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

['5,921,901'] 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

['1,967,721'] 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

['958,498'] 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

['9,948,386'] 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

['346,483'] 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

['2,524,720'] 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

['364,415'] 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

['2,847,712'] 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

['3,000,115'] 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

['2,108,561'] 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

['2,938,818'] 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

['2,520,700'] 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

['5,295,836'] 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

['1,831,741'] 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

['9,425,630'] 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

['2,262,758'] 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

['3,040,115'] 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

['2,006,561'] 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

['3,445,658'] 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

['4,787,227'] 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

['3,324,874'] 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

['1,208,081'] 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

['1,762,742'] 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

['2,087,474'] 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

['2,611,966'] 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

['1,246,185'] 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

['13,934,592'] 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

['592,435'] 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

['953,682'] 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

['3,436,092'] 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

['2,729,827'] 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

['2,051,386'] 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

['2,394,487'] 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

['1,593,694'] 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

['4,002,560'] 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

['2,950,097'] 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

['2,051,315'] 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

['3,872,015'] 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

['1,855,515'] 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

['5,181,244'] 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

['137,788'] 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

['2,308,646'] 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

['1,722,017'] 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

['4,313,871'] 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

['3,100,113'] 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

['3,283,434'] 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

['1,855,917'] 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

['5,138,328'] 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

['2,007,665'] 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

['1,362,114'] 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

['1,689,717'] 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

['2,095,592'] 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

['612,328'] 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

['2,241,687'] 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

['2,192,525'] 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

['2,444,136'] 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

['3,715,089'] 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

['2,165,401'] 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

['5,448,134'] 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

['2,841,884'] 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

['1,472,147'] 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

['2,614,601'] 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

['4,058,225'] 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

['450,378'] 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

['73,483'] 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

['1,515,104'] 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

['3,884,130'] 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

['1,676,040'] 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

['2,718,158'] 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

['2,475,797'] 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

['2,436,884'] 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

['1,160,021'] 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

['1,599,598'] 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

['1,028,384'] 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

['2,169,109'] 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

['1,015,392'] 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

['1,898,220'] 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

['277,370'] 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

['262,233'] 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

['1,310,895'] 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

['2,299,732'] 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

['1,141,222'] 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

['884,988'] 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

['0'] 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

['3,963,964'] 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

['1,128,288'] 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

['1,330,183'] 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

['6,399,303'] 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

['3,044,859'] 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

['5,802,811'] 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

['2,601,761'] 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

['4,168,353'] 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

['2,963,652'] 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

['1,127,373'] 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

['4,802,416'] 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

['5,835,017'] 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

['1,231,261'] 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

['558,443'] 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

['4,662,926'] 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

['2,534,748'] 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

['272,062'] 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

['1,500,830'] 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

['2,711,094'] 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

['110,771'] 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

['1,790,916'] 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

['4,699,307'] 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

['1,730,773'] 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

['870,759'] 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

['1,403,019'] 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

['1,764,233'] 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

['1,338,411'] 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

['1,163,274'] 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

['2,658,589'] 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

['2,985,556'] 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

['1,775,033'] 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

['1,307,226'] 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

['2,192,276'] 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

['919,202'] 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

['768,442'] 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

['0'] 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

['3,033,105'] 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

['3,430,975'] 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

['837,500'] 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

['1,552,055'] 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

['790,181'] 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

['103,628'] 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

['3,579,666'] 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

['2,866,453'] 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

['2,254,430'] 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

['844'] 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

['1,786,386'] 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

['1,461'] 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

['537,920'] 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

['223,740'] 

FINISHED
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

['10,298,743'] 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

['6,880,546'] 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

['14,411,775'] 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

['16,265,618'] 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

['13,414,484'] 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

['6,879,989'] 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

['4,684,571'] 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

['2,452,245'] 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

['9,135,806'] 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

['2,636,385'] 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

['12,984,692'] 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

['6,975,631'] 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

['11,212,710'] 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

['12,706,819'] 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

['12,324,002'] 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

['12,811,624'] 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

['9,707,581'] 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

['17,615,658'] 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

['12,276,350'] 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

['3,189,091'] 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

['11,567,662'] 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

['7,075,607'] 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

['5,546,823'] 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

['4,720,050'] 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

['8,660,623'] 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

['7,817,654'] 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

['2,310,206'] 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

['6,129,681'] 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

['2,971,475'] 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

['12,189,654'] 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

['5,294,154'] 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

['14,263,578'] 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

['5,653,444'] 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

['2,084,909'] 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

['4,706,158'] 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

['5,063,844'] 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

['1,110,274'] 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

['3,364,712'] 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

['1,593,386'] 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

['2,625,636'] 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

['4,288,908'] 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

['4,452,850'] 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

['11,375,123'] 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

['1,051,710'] 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

['4,113,696'] 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

['7,232,387'] 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

['3,317,196'] 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

['8,666,208'] 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

['4,018,341'] 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

['2,931,897'] 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

['5,317,959'] 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

['446,054'] 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

['5,447,269'] 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

['10,085,093'] 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

['5,661,128'] 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

['2,594,695'] 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

['3,789,553'] 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

['6,044,956'] 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

['3,897,969'] 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

['5,441,020'] 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

['4,015,361'] 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

['6,247,651'] 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

['4,945,484'] 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

['7,166,688'] 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

['4,858,572'] 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

['5,399,327'] 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

['7,258,678'] 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

['1,346,511'] 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

['3,689,325'] 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

['3,566,852'] 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

['7,120,780'] 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

['3,513,114'] 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

['4,598,985'] 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

['3,420,116'] 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

['2,860,786'] 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

['7,150,586'] 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

['1,441,990'] 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

['4,881,865'] 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

['3,849,700'] 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

['9,001,679'] 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

['10,494,840'] 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

['7,073,516'] 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

['2,812,427'] 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

['3,601,434'] 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

['931,953'] 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

['7,500,457'] 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

['6,592,151'] 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

['3,755,233'] 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

['5,443,232'] 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

['2,625,686'] 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

['2,654,817'] 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

['4,775,811'] 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

['3,888,096'] 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

['5,038,154'] 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

['1,917,999'] 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

['5,311,353'] 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

['6,959,083'] 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

['6,584,915'] 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

['4,969,735'] 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

['3,152,895'] 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

['4,975,517'] 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

['2,718,237'] 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

['963,763'] 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

['5,509,019'] 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

['5,604,106'] 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

['3,611,166'] 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

['9,352,448'] 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

['1,826,912'] 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

['7,759,761'] 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

['2,318,748'] 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

['6,655,068'] 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

['1,128,774'] 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

['5,237,525'] 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

['2,736,060'] 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

['4,131,338'] 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

['1,744,585'] 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

['1,515,356'] 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

['3,450,305'] 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

['8,678,117'] 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

['3,407,564'] 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

['6,126,488'] 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

['3,248,904'] 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

['4,667,179'] 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

['1,864,076'] 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

['10,309,432'] 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

['3,849,129'] 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

['1,094,404'] 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

['1,344,599'] 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

['1,166,025'] 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

['1,462,561'] 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

['4,585,116'] 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

['4,516,063'] 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

['2,982,514'] 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

['461,693'] 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

['3,784,602'] 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

['2,588,628'] 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

['2,564,340'] 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

['1,711,246'] 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

['267,950'] 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

['2,801,949'] 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

['3,117,859'] 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

['3,389,125'] 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

['3,653,238'] 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

['3,984,814'] 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

['1,629,528'] 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

['2,744,413'] 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

['3,240,370'] 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

['5,584,295'] 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

['7,051,237'] 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

['827,338'] 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

['7,508,976'] 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

['608,273'] 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

['988,451'] 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

['2,058,096'] 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

['1,492,903'] 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

['1,646,142'] 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

['1,635,003'] 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

['2,515,590'] 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

['2,138,524'] 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

['4,909,950'] 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

['2,434,435'] 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

['1,974,893'] 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

['2,675,883'] 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

['1,385,511'] 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

['4,853,273'] 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

['1,110,523'] 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

['5,921,901'] 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

['1,967,721'] 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

['958,498'] 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

['9,948,386'] 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

['346,483'] 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

['2,524,720'] 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

['364,415'] 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

['2,847,712'] 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

['3,000,115'] 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

['2,108,561'] 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

['2,938,818'] 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

['2,520,700'] 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

['5,295,836'] 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

['1,831,741'] 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

['9,425,630'] 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

['2,262,758'] 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

['3,040,115'] 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

['2,006,561'] 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

['3,445,658'] 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

['4,787,227'] 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

['3,324,874'] 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

['1,208,081'] 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

['1,762,742'] 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

['2,087,474'] 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

['2,611,966'] 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

['1,246,185'] 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

['13,934,592'] 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

['592,435'] 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

['953,682'] 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

['3,436,092'] 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

['2,729,827'] 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

['2,051,386'] 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

['2,394,487'] 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

['1,593,694'] 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

['4,002,560'] 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

['2,950,097'] 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

['2,051,315'] 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

['3,872,015'] 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

['1,855,515'] 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

['5,181,244'] 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

['137,788'] 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

['2,308,646'] 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

['1,722,017'] 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

['4,313,871'] 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

['3,100,113'] 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

['3,283,434'] 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

['1,855,917'] 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

['5,138,328'] 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

['2,007,665'] 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

['1,362,114'] 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

['1,689,717'] 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

['2,095,592'] 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

['612,328'] 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

['2,241,687'] 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

['2,192,525'] 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

['2,444,136'] 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

['3,715,089'] 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

['2,165,401'] 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

['5,448,134'] 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

['2,841,884'] 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

['1,472,147'] 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

['2,614,601'] 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

['4,058,225'] 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

['450,378'] 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

['73,483'] 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

['1,515,104'] 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

['3,884,130'] 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

['1,676,040'] 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

['2,718,158'] 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

['2,475,797'] 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

['2,436,884'] 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

['1,160,021'] 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

['1,599,598'] 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

['1,028,384'] 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

['2,169,109'] 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

['1,015,392'] 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

['1,898,220'] 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

['277,370'] 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

['262,233'] 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

['1,310,895'] 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

['2,299,732'] 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

['1,141,222'] 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

['884,988'] 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

['0'] 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

['3,963,964'] 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

['1,128,288'] 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

['1,330,183'] 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

['6,399,303'] 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

['3,044,859'] 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

['5,802,811'] 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

['2,601,761'] 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

['4,168,353'] 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

['2,963,652'] 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

['1,127,373'] 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

['4,802,416'] 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

['5,835,017'] 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

['1,231,261'] 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

['558,443'] 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

['4,662,926'] 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

['2,534,748'] 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

['272,062'] 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

['1,500,830'] 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

['2,711,094'] 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

['110,771'] 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

['1,790,916'] 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

['4,699,307'] 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

['1,730,773'] 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

['870,759'] 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

['1,403,019'] 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

['1,764,233'] 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

['1,338,411'] 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

['1,163,274'] 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

['2,658,589'] 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

['2,985,556'] 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

['1,775,033'] 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

['1,307,226'] 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

['2,192,276'] 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

['919,202'] 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

['768,442'] 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

['0'] 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

['3,033,105'] 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

['3,430,975'] 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

['837,500'] 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

['1,552,055'] 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

['790,181'] 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

['103,628'] 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

['3,579,666'] 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

['2,866,453'] 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

['2,254,430'] 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

['844'] 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

['1,786,386'] 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

['1,461'] 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

['537,920'] 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

['223,740'] 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 86, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 65, in Online_Movie
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 80, in Analysis
    counting[i]=counting[i]+int(line[4])
ValueError: invalid literal for int() with base 10: '"10'
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '0', '2', '9', '8', '7', '4', '3', '"', '>', '1', '0', '2', '9', '8', '7', '4', '3', '<', '/', 't', 'd', '>'] 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '6', '8', '8', '0', '5', '4', '6', '"', '>', '6', '8', '8', '0', '5', '4', '6', '<', '/', 't', 'd', '>'] 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '4', '4', '1', '1', '7', '7', '5', '"', '>', '1', '4', '4', '1', '1', '7', '7', '5', '<', '/', 't', 'd', '>'] 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '6', '2', '6', '5', '6', '1', '8', '"', '>', '1', '6', '2', '6', '5', '6', '1', '8', '<', '/', 't', 'd', '>'] 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '3', '4', '1', '4', '4', '8', '4', '"', '>', '1', '3', '4', '1', '4', '4', '8', '4', '<', '/', 't', 'd', '>'] 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '6', '8', '7', '9', '9', '8', '9', '"', '>', '6', '8', '7', '9', '9', '8', '9', '<', '/', 't', 'd', '>'] 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '4', '6', '8', '4', '5', '7', '1', '"', '>', '4', '6', '8', '4', '5', '7', '1', '<', '/', 't', 'd', '>'] 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '2', '4', '5', '2', '2', '4', '5', '"', '>', '2', '4', '5', '2', '2', '4', '5', '<', '/', 't', 'd', '>'] 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '9', '1', '3', '5', '8', '0', '6', '"', '>', '9', '1', '3', '5', '8', '0', '6', '<', '/', 't', 'd', '>'] 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '2', '6', '3', '6', '3', '8', '5', '"', '>', '2', '6', '3', '6', '3', '8', '5', '<', '/', 't', 'd', '>'] 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '2', '9', '8', '4', '6', '9', '2', '"', '>', '1', '2', '9', '8', '4', '6', '9', '2', '<', '/', 't', 'd', '>'] 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '6', '9', '7', '5', '6', '3', '1', '"', '>', '6', '9', '7', '5', '6', '3', '1', '<', '/', 't', 'd', '>'] 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '1', '2', '1', '2', '7', '1', '0', '"', '>', '1', '1', '2', '1', '2', '7', '1', '0', '<', '/', 't', 'd', '>'] 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '2', '7', '0', '6', '8', '1', '9', '"', '>', '1', '2', '7', '0', '6', '8', '1', '9', '<', '/', 't', 'd', '>'] 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '2', '3', '2', '4', '0', '0', '2', '"', '>', '1', '2', '3', '2', '4', '0', '0', '2', '<', '/', 't', 'd', '>'] 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '2', '8', '1', '1', '6', '2', '4', '"', '>', '1', '2', '8', '1', '1', '6', '2', '4', '<', '/', 't', 'd', '>'] 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '9', '7', '0', '7', '5', '8', '1', '"', '>', '9', '7', '0', '7', '5', '8', '1', '<', '/', 't', 'd', '>'] 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '7', '6', '1', '5', '6', '5', '8', '"', '>', '1', '7', '6', '1', '5', '6', '5', '8', '<', '/', 't', 'd', '>'] 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '2', '2', '7', '6', '3', '5', '0', '"', '>', '1', '2', '2', '7', '6', '3', '5', '0', '<', '/', 't', 'd', '>'] 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '3', '1', '8', '9', '0', '9', '1', '"', '>', '3', '1', '8', '9', '0', '9', '1', '<', '/', 't', 'd', '>'] 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '1', '5', '6', '7', '6', '6', '2', '"', '>', '1', '1', '5', '6', '7', '6', '6', '2', '<', '/', 't', 'd', '>'] 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '7', '0', '7', '5', '6', '0', '7', '"', '>', '7', '0', '7', '5', '6', '0', '7', '<', '/', 't', 'd', '>'] 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '5', '5', '4', '6', '8', '2', '3', '"', '>', '5', '5', '4', '6', '8', '2', '3', '<', '/', 't', 'd', '>'] 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '4', '7', '2', '0', '0', '5', '0', '"', '>', '4', '7', '2', '0', '0', '5', '0', '<', '/', 't', 'd', '>'] 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '8', '6', '6', '0', '6', '2', '3', '"', '>', '8', '6', '6', '0', '6', '2', '3', '<', '/', 't', 'd', '>'] 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '7', '8', '1', '7', '6', '5', '4', '"', '>', '7', '8', '1', '7', '6', '5', '4', '<', '/', 't', 'd', '>'] 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '2', '3', '1', '0', '2', '0', '6', '"', '>', '2', '3', '1', '0', '2', '0', '6', '<', '/', 't', 'd', '>'] 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '6', '1', '2', '9', '6', '8', '1', '"', '>', '6', '1', '2', '9', '6', '8', '1', '<', '/', 't', 'd', '>'] 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '2', '9', '7', '1', '4', '7', '5', '"', '>', '2', '9', '7', '1', '4', '7', '5', '<', '/', 't', 'd', '>'] 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '2', '1', '8', '9', '6', '5', '4', '"', '>', '1', '2', '1', '8', '9', '6', '5', '4', '<', '/', 't', 'd', '>'] 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '5', '2', '9', '4', '1', '5', '4', '"', '>', '5', '2', '9', '4', '1', '5', '4', '<', '/', 't', 'd', '>'] 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '4', '2', '6', '3', '5', '7', '8', '"', '>', '1', '4', '2', '6', '3', '5', '7', '8', '<', '/', 't', 'd', '>'] 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '5', '6', '5', '3', '4', '4', '4', '"', '>', '5', '6', '5', '3', '4', '4', '4', '<', '/', 't', 'd', '>'] 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '2', '0', '8', '4', '9', '0', '9', '"', '>', '2', '0', '8', '4', '9', '0', '9', '<', '/', 't', 'd', '>'] 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '4', '7', '0', '6', '1', '5', '8', '"', '>', '4', '7', '0', '6', '1', '5', '8', '<', '/', 't', 'd', '>'] 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '5', '0', '6', '3', '8', '4', '4', '"', '>', '5', '0', '6', '3', '8', '4', '4', '<', '/', 't', 'd', '>'] 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '1', '1', '0', '2', '7', '4', '"', '>', '1', '1', '1', '0', '2', '7', '4', '<', '/', 't', 'd', '>'] 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '3', '3', '6', '4', '7', '1', '2', '"', '>', '3', '3', '6', '4', '7', '1', '2', '<', '/', 't', 'd', '>'] 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '1', '5', '9', '3', '3', '8', '6', '"', '>', '1', '5', '9', '3', '3', '8', '6', '<', '/', 't', 'd', '>'] 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '2', '6', '2', '5', '6', '3', '6', '"', '>', '2', '6', '2', '5', '6', '3', '6', '<', '/', 't', 'd', '>'] 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

['<', 't', 'd', ' ', 'c', 'l', 'a', 's', 's', '=', '"', 't', 'a', 'r', '"', ' ', 't', 'i', 't', 'l', 'e', '=', '"', '4', '2', '8', '8', '9', '0', '8', '"', '>', '4', '2', '8', '8', '9', '0', '8', '<', '/', 't', 'd', '>']Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 86, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 58, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 46, in Online_Movie_URL
    print(impo_audience,"\n")
KeyboardInterrupt
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

['10298743'] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 86, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 59, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 48, in Online_Movie_URL
    result.append(impo_title + impo_release + impo_genre + impo_audience)
TypeError: can only concatenate list (not "str") to list
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 85, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 58, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 45, in Online_Movie_URL
    impo_audience = list(impo).replace(',',"")
AttributeError: 'list' object has no attribute 'replace'
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

['[', "'", '1', '0', '2', '9', '8', '7', '4', '3', "'", ']'] 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

['[', "'", '6', '8', '8', '0', '5', '4', '6', "'", ']'] 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

['[', "'", '1', '4', '4', '1', '1', '7', '7', '5', "'", ']'] 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

['[', "'", '1', '6', '2', '6', '5', '6', '1', '8', "'", ']'] 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

['[', "'", '1', '3', '4', '1', '4', '4', '8', '4', "'", ']'] 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

['[', "'", '6', '8', '7', '9', '9', '8', '9', "'", ']'] 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

['[', "'", '4', '6', '8', '4', '5', '7', '1', "'", ']'] 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

['[', "'", '2', '4', '5', '2', '2', '4', '5', "'", ']'] 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

['[', "'", '9', '1', '3', '5', '8', '0', '6', "'", ']'] 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

['[', "'", '2', '6', '3', '6', '3', '8', '5', "'", ']'] 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

['[', "'", '1', '2', '9', '8', '4', '6', '9', '2', "'", ']'] 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

['[', "'", '6', '9', '7', '5', '6', '3', '1', "'", ']'] 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

['[', "'", '1', '1', '2', '1', '2', '7', '1', '0', "'", ']'] 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

['[', "'", '1', '2', '7', '0', '6', '8', '1', '9', "'", ']'] 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

['[', "'", '1', '2', '3', '2', '4', '0', '0', '2', "'", ']'] 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

['[', "'", '1', '2', '8', '1', '1', '6', '2', '4', "'", ']'] 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

['[', "'", '9', '7', '0', '7', '5', '8', '1', "'", ']'] 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

['[', "'", '1', '7', '6', '1', '5', '6', '5', '8', "'", ']'] 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

['[', "'", '1', '2', '2', '7', '6', '3', '5', '0', "'", ']'] 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

['[', "'", '3', '1', '8', '9', '0', '9', '1', "'", ']'] 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

['[', "'", '1', '1', '5', '6', '7', '6', '6', '2', "'", ']'] 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

['[', "'", '7', '0', '7', '5', '6', '0', '7', "'", ']'] 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

['[', "'", '5', '5', '4', '6', '8', '2', '3', "'", ']'] 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

['[', "'", '4', '7', '2', '0', '0', '5', '0', "'", ']'] 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

['[', "'", '8', '6', '6', '0', '6', '2', '3', "'", ']'] 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

['[', "'", '7', '8', '1', '7', '6', '5', '4', "'", ']'] 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

['[', "'", '2', '3', '1', '0', '2', '0', '6', "'", ']'] 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

['[', "'", '6', '1', '2', '9', '6', '8', '1', "'", ']'] 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

['[', "'", '2', '9', '7', '1', '4', '7', '5', "'", ']'] 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

['[', "'", '1', '2', '1', '8', '9', '6', '5', '4', "'", ']'] 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

['[', "'", '5', '2', '9', '4', '1', '5', '4', "'", ']'] 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

['[', "'", '1', '4', '2', '6', '3', '5', '7', '8', "'", ']'] 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

['[', "'", '5', '6', '5', '3', '4', '4', '4', "'", ']'] 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

['[', "'", '2', '0', '8', '4', '9', '0', '9', "'", ']'] 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

['[', "'", '4', '7', '0', '6', '1', '5', '8', "'", ']'] 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

['[', "'", '5', '0', '6', '3', '8', '4', '4', "'", ']'] 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

['[', "'", '1', '1', '1', '0', '2', '7', '4', "'", ']'] 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

['[', "'", '3', '3', '6', '4', '7', '1', '2', "'", ']'] 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

['[', "'", '1', '5', '9', '3', '3', '8', '6', "'", ']'] 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

['[', "'", '2', '6', '2', '5', '6', '3', '6', "'", ']'] 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

['[', "'", '4', '2', '8', '8', '9', '0', '8', "'", ']'] 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

['[', "'", '4', '4', '5', '2', '8', '5', '0', "'", ']'] 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

['[', "'", '1', '1', '3', '7', '5', '1', '2', '3', "'", ']'] 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

['[', "'", '1', '0', '5', '1', '7', '1', '0', "'", ']'] 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

['[', "'", '4', '1', '1', '3', '6', '9', '6', "'", ']'] 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 87, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 60, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 40, in Online_Movie_URL
    print(impo_release,"\n")
KeyboardInterrupt
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

<class 'str'>
['10298743'] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 87, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 60, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 49, in Online_Movie_URL
    result.append(impo_title + impo_release + impo_genre + impo_audience)
TypeError: can only concatenate list (not "str") to list
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 88, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 61, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 13, in Online_Movie_URL
    wd.get(Movie_URL)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\selenium\webdriver\remote\webdriver.py", line 333, in get
    self.execute(Command.GET, {'url': url})
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\selenium\webdriver\remote\webdriver.py", line 319, in execute
    response = self.command_executor.execute(driver_command, params)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\selenium\webdriver\remote\remote_connection.py", line 374, in execute
    return self._request(command_info[0], url, body=data)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\selenium\webdriver\remote\remote_connection.py", line 397, in _request
    resp = self._conn.request(method, url, body=body, headers=headers)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\request.py", line 80, in request
    method, url, fields=fields, headers=headers, **urlopen_kw
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\request.py", line 171, in request_encode_body
    return self.urlopen(method, url, **extra_kw)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\poolmanager.py", line 330, in urlopen
    response = conn.urlopen(method, u.request_uri, **kw)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\connectionpool.py", line 672, in urlopen
    chunked=chunked,
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\connectionpool.py", line 421, in _make_request
    six.raise_from(e, None)
  File "<string>", line 3, in raise_from
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\connectionpool.py", line 416, in _make_request
    httplib_response = conn.getresponse()
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\http\client.py", line 1321, in getresponse
    response.begin()
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\http\client.py", line 296, in begin
    version, status, reason = self._read_status()
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\http\client.py", line 257, in _read_status
    line = str(self.fp.readline(_MAXLINE + 1), "iso-8859-1")
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\socket.py", line 589, in readinto
    return self._sock.recv_into(b)
KeyboardInterrupt
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

['10298743'] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 88, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 61, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 50, in Online_Movie_URL
    result.append(impo_title + impo_release + impo_genre + impo_audience)
TypeError: can only concatenate list (not "str") to list
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

['10298743'] 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

['6880546'] 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

['14411775'] 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

['16265618'] 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

['13414484'] 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

['6879989'] 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

['4684571'] 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

['2452245'] 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

['9135806'] 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

['2636385'] 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

['12984692'] 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

['6975631'] 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

['11212710'] 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

['12706819'] 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

['12324002'] 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

['12811624'] 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

['9707581'] 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

['17615658'] 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

['12276350'] 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

['3189091'] 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

['11567662'] 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

['7075607'] 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

['5546823'] 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

['4720050'] 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

['8660623'] 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

['7817654'] 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

['2310206'] 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

['6129681'] 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

['2971475'] 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

['12189654'] 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

['5294154'] 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

['14263578'] 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

['5653444'] 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

['2084909'] 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

['4706158'] 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

['5063844'] 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

['1110274'] 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

['3364712'] 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

['1593386'] 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

['2625636'] 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

['4288908'] 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

['4452850'] 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

['11375123'] 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

['1051710'] 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

['4113696'] 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

['7232387'] 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

['3317196'] 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

['8666208'] 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

['4018341'] 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

['2931897'] 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

['5317959'] 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

['446054'] 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

['5447269'] 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

['10085092'] 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

['5661128'] 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

['2594695'] 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

['3789553'] 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

['6044956'] 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

['3897969'] 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

['5441020'] 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

['4015361'] 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

['6247651'] 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

['4945484'] 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

['7166688'] 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

['4858572'] 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

['5399327'] 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

['7258678'] 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

['1346511'] 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

['3689325'] 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

['3566852'] 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

['7120780'] 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

['3513114'] 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

['4598985'] 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

['3420116'] 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

['2860786'] 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

['7150586'] 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

['1441990'] 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

['4881865'] 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

['3849700'] 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

['9001679'] 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

['10494840'] 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

['7073516'] 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

['2812427'] 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

['3601434'] 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

['931953'] 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

['7500457'] 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

['6592151'] 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

['3755233'] 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

['5443232'] 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

['2625686'] 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

['2654817'] 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

['4775811'] 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

['3888096'] 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

['5038154'] 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

['1917999'] 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

['5311353'] 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

['6959083'] 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

['6584915'] 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

['4969735'] 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

['3152895'] 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

['4975517'] 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

['2718237'] 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

['963763'] 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

['5509019'] 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

['5604106'] 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

['3611166'] 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

['9352448'] 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

['1826912'] 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

['7759761'] 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

['2318748'] 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

['6655068'] 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

['1128774'] 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

['5237525'] 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

['2736060'] 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

['4131338'] 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

['1744585'] 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

['1515356'] 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

['3450305'] 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

['8678117'] 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

['3407564'] 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

['6126488'] 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

['3248904'] 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

['4667179'] 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

['1864076'] 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

['10309432'] 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

['3849129'] 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

['1094404'] 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

['1344599'] 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

['1166025'] 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

['1462561'] 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

['4585116'] 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

['4516063'] 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

['2982514'] 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

['461693'] 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

['3784602'] 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

['2588628'] 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

['2564340'] 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

['1711246'] 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

['267950'] 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

['2801949'] 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

['3117859'] 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

['3389125'] 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

['3653238'] 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

['3984814'] 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

['1629528'] 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

['2744413'] 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

['3240370'] 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

['5584295'] 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

['7051237'] 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

['827338'] 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

['7508976'] 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

['608273'] 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

['988451'] 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

['2058096'] 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

['1492903'] 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

['1646142'] 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

['1635003'] 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

['2515590'] 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

['2138524'] 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

['4909950'] 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

['2434435'] 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

['1974893'] 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

['2675883'] 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

['1385511'] 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

['4853273'] 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

['1110523'] 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

['5921903'] 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

['1967721'] 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

['958498'] 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

['9948386'] 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

['346483'] 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

['2524720'] 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

['364415'] 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

['2847712'] 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

['3000115'] 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

['2108561'] 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

['2938818'] 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

['2520700'] 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

['5295836'] 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

['1831741'] 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

['9425630'] 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

['2262758'] 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

['3040115'] 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

['2006561'] 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

['3445658'] 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

['4787227'] 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

['3324874'] 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

['1208081'] 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

['1762742'] 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

['2087474'] 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

['2611966'] 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

['1246185'] 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

['13934592'] 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

['592435'] 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

['953682'] 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

['3436092'] 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

['2729827'] 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

['2051386'] 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

['2394487'] 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

['1593694'] 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

['4002560'] 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

['2950097'] 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

['2051315'] 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

['3872015'] 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

['1855515'] 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

['5181244'] 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

['137788'] 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

['2308646'] 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

['1722017'] 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

['4313871'] 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

['3100113'] 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

['3283434'] 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

['1855917'] 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

['5138328'] 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

['2007665'] 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

['1362114'] 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

['1689717'] 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

['2095592'] 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

['612328'] 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

['2241687'] 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

['2192525'] 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

['2444136'] 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

['3715089'] 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

['2165401'] 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

['5448134'] 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

['2841884'] 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

['1472147'] 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

['2614601'] 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

['4058225'] 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

['450378'] 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

['73483'] 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

['1515104'] 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

['3884130'] 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

['1676040'] 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

['2718158'] 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

['2475797'] 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

['2436884'] 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

['1160021'] 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

['1599598'] 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

['1028384'] 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

['2169109'] 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

['1015392'] 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

['1898220'] 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

['277370'] 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

['262233'] 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

['1310895'] 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

['2299732'] 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

['1141222'] 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

['884988'] 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

['0'] 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

['3963964'] 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

['1128288'] 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

['1330183'] 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

['6399303'] 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

['3044859'] 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

['5802811'] 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

['2601761'] 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

['4168353'] 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

['2963652'] 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

['1127373'] 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

['4802416'] 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

['5835017'] 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

['1231261'] 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

['558443'] 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

['4662926'] 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

['2534748'] 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

['272062'] 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

['1500830'] 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

['2711094'] 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

['110771'] 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

['1790916'] 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

['4699307'] 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

['1730773'] 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

['870759'] 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

['1403019'] 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

['1764233'] 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

['1338411'] 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

['1163274'] 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

['2658589'] 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

['2985556'] 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

['1775033'] 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

['1307226'] 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

['2192276'] 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

['919202'] 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

['768442'] 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

['0'] 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

['3033105'] 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

['3430975'] 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

['837500'] 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

['1552055'] 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

['790181'] 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

['103628'] 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

['3579666'] 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

['2866453'] 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

['2254430'] 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

['844'] 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

['1786386'] 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

['1461'] 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

['537920'] 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

['223740'] 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 88, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 67, in Online_Movie
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 82, in Analysis
    counting[i]=counting[i]+int(line[4])
ValueError: invalid literal for int() with base 10: "['10298743']\n"
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

['10298743'] 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

['6880546'] 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

['14411775'] 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

['16265618'] 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

['13414484'] 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

['6879989'] 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

['4684571'] 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

['2452245'] 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

['9135806'] 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

['2636385'] 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

['12984692'] 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

['6975631'] 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

['11212710'] 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

['12706819'] 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

['12324002'] 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

['12811624'] 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

['9707581'] 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

['17615658'] 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

['12276350'] 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

['3189091'] 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

['11567662'] 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

['7075607'] 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

['5546823'] 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

['4720050'] 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

['8660623'] 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

['7817654'] 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

['2310206'] 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

['6129681'] 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

['2971475'] 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

['12189654'] 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

['5294154'] 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

['14263578'] 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

['5653444'] 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

['2084909'] 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

['4706158'] 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

['5063844'] 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

['1110274'] 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

['3364712'] 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

['1593386'] 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

['2625636'] 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

['4288908'] 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

['4452850'] 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

['11375123'] 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

['1051710'] 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

['4113696'] 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

['7232387'] 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

['3317196'] 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

['8666208'] 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

['4018341'] 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

['2931897'] 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

['5317959'] 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

['446054'] 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

['5447269'] 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

['10085092'] 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

['5661128'] 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

['2594695'] 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

['3789553'] 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

['6044956'] 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

['3897969'] 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

['5441020'] 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

['4015361'] 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

['6247651'] 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

['4945484'] 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

['7166688'] 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

['4858572'] 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

['5399327'] 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

['7258678'] 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

['1346511'] 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

['3689325'] 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

['3566852'] 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

['7120780'] 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

['3513114'] 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

['4598985'] 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

['3420116'] 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

['2860786'] 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

['7150586'] 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

['1441990'] 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

['4881865'] 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

['3849700'] 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

['9001679'] 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

['10494840'] 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

['7073516'] 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

['2812427'] 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

['3601434'] 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

['931953'] 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

['7500457'] 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

['6592151'] 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

['3755233'] 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

['5443232'] 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

['2625686'] 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

['2654817'] 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

['4775811'] 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

['3888096'] 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

['5038154'] 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

['1917999'] 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

['5311353'] 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

['6959083'] 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

['6584915'] 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

['4969735'] 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

['3152895'] 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

['4975517'] 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

['2718237'] 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

['963763'] 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

['5509019'] 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

['5604106'] 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

['3611166'] 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

['9352448'] 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

['1826912'] 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

['7759761'] 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

['2318748'] 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

['6655068'] 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

['1128774'] 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

['5237525'] 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

['2736060'] 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

['4131338'] 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

['1744585'] 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

['1515356'] 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

['3450305'] 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

['8678117'] 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

['3407564'] 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

['6126488'] 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

['3248904'] 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

['4667179'] 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

['1864076'] 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

['10309432'] 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

['3849129'] 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

['1094404'] 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

['1344599'] 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

['1166025'] 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

['1462561'] 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

['4585116'] 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

['4516063'] 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

['2982514'] 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

['461693'] 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

['3784602'] 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

['2588628'] 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

['2564340'] 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

['1711246'] 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

['267950'] 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

['2801949'] 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

['3117859'] 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

['3389125'] 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

['3653238'] 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

['3984814'] 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

['1629528'] 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

['2744413'] 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

['3240370'] 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

['5584295'] 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

['7051237'] 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

['827338'] 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

['7508976'] 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

['608273'] 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

['988451'] 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

['2058096'] 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

['1492903'] 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

['1646142'] 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

['1635003'] 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

['2515590'] 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

['2138524'] 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

['4909950'] 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

['2434435'] 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

['1974893'] 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

['2675883'] 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

['1385511'] 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

['4853273'] 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

['1110523'] 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

['5921903'] 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

['1967721'] 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

['958498'] 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

['9948386'] 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

['346483'] 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

['2524720'] 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

['364415'] 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

['2847712'] 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

['3000115'] 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

['2108561'] 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

['2938818'] 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

['2520700'] 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

['5295836'] 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

['1831741'] 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

['9425630'] 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

['2262758'] 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

['3040115'] 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

['2006561'] 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

['3445658'] 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

['4787227'] 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

['3324874'] 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

['1208081'] 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

['1762742'] 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

['2087474'] 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

['2611966'] 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

['1246185'] 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

['13934592'] 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

['592435'] 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

['953682'] 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

['3436092'] 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

['2729827'] 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

['2051386'] 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

['2394487'] 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

['1593694'] 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

['4002560'] 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

['2950097'] 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

['2051315'] 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

['3872015'] 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

['1855515'] 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

['5181244'] 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

['137788'] 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

['2308646'] 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

['1722017'] 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

['4313871'] 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

['3100113'] 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

['3283434'] 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

['1855917'] 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

['5138328'] 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

['2007665'] 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

['1362114'] 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

['1689717'] 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

['2095592'] 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

['612328'] 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

['2241687'] 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

['2192525'] 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

['2444136'] 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

['3715089'] 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

['2165401'] 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

['5448134'] 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

['2841884'] 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

['1472147'] 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

['2614601'] 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

['4058225'] 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

['450378'] 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

['73483'] 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

['1515104'] 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

['3884130'] 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

['1676040'] 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

['2718158'] 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

['2475797'] 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

['2436884'] 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

['1160021'] 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

['1599598'] 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

['1028384'] 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

['2169109'] 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

['1015392'] 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

['1898220'] 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

['277370'] 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

['262233'] 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

['1310895'] 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

['2299732'] 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

['1141222'] 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

['884988'] 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

['0'] 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

['3963964'] 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

['1128288'] 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

['1330183'] 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

['6399303'] 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

['3044859'] 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

['5802811'] 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

['2601761'] 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

['4168353'] 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

['2963652'] 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

['1127373'] 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

['4802416'] 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

['5835017'] 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

['1231261'] 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

['558443'] 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

['4662926'] 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

['2534748'] 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

['272062'] 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

['1500830'] 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

['2711094'] 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

['110771'] 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

['1790916'] 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

['4699307'] 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

['1730773'] 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

['870759'] 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

['1403019'] 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

['1764233'] 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

['1338411'] 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

['1163274'] 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

['2658589'] 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

['2985556'] 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

['1775033'] 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

['1307226'] 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

['2192276'] 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

['919202'] 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

['768442'] 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

['0'] 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

['3033105'] 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

['3430975'] 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

['837500'] 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

['1552055'] 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

['790181'] 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

['103628'] 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

['3579666'] 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

['2866453'] 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

['2254430'] 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

['844'] 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

['1786386'] 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

['1461'] 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

['537920'] 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

['223740'] 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['10298743']

<class 'str'>
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 90, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 67, in Online_Movie
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 84, in Analysis
    counting[i]=counting[i]+int(line[4])
ValueError: invalid literal for int() with base 10: "['10298743']\n"
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

['10298743'] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 90, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 61, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 50, in Online_Movie_URL
    result.append(impo_title + impo_release + impo_genre + impo_audience)
TypeError: can only concatenate list (not "str") to list
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 91, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 62, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 47, in Online_Movie_URL
    impo_audience.replace("'",'')
AttributeError: 'list' object has no attribute 'replace'
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

[10298743] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 91, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 62, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 51, in Online_Movie_URL
    result.append(impo_title + impo_release + impo_genre + impo_audience)
TypeError: can only concatenate list (not "str") to list
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

[ 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 91, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 62, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 51, in Online_Movie_URL
    result.append(impo_title + impo_release + impo_genre + impo_audience)
TypeError: can only concatenate list (not "str") to list
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

<td class="tar" title="10,298,743">10,298,743</td> 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 94, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 65, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 54, in Online_Movie_URL
    result.append(impo_title + impo_release + impo_genre + impo_audience)
TypeError: can only concatenate list (not "str") to list
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 96, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 67, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 13, in Online_Movie_URL
    wd.get(Movie_URL)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\selenium\webdriver\remote\webdriver.py", line 333, in get
    self.execute(Command.GET, {'url': url})
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\selenium\webdriver\remote\webdriver.py", line 319, in execute
    response = self.command_executor.execute(driver_command, params)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\selenium\webdriver\remote\remote_connection.py", line 374, in execute
    return self._request(command_info[0], url, body=data)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\selenium\webdriver\remote\remote_connection.py", line 397, in _request
    resp = self._conn.request(method, url, body=body, headers=headers)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\request.py", line 80, in request
    method, url, fields=fields, headers=headers, **urlopen_kw
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\request.py", line 171, in request_encode_body
    return self.urlopen(method, url, **extra_kw)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\poolmanager.py", line 330, in urlopen
    response = conn.urlopen(method, u.request_uri, **kw)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\connectionpool.py", line 672, in urlopen
    chunked=chunked,
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\connectionpool.py", line 421, in _make_request
    six.raise_from(e, None)
  File "<string>", line 3, in raise_from
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\urllib3\connectionpool.py", line 416, in _make_request
    httplib_response = conn.getresponse()
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\http\client.py", line 1321, in getresponse
    response.begin()
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\http\client.py", line 296, in begin
    version, status, reason = self._read_status()
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\http\client.py", line 257, in _read_status
    line = str(self.fp.readline(_MAXLINE + 1), "iso-8859-1")
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\socket.py", line 589, in readinto
    return self._sock.recv_into(b)
KeyboardInterrupt
>>> 
KeyboardInterrupt
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10,298,743 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 96, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 67, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 56, in Online_Movie_URL
    result.append(impo_title + impo_release + impo_genre + impo_audience)
TypeError: can only concatenate list (not "str") to list
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 96, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 67, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 48, in Online_Movie_URL
    impo_audinece.replace(',','')
NameError: name 'impo_audinece' is not defined
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 96, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 67, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 48, in Online_Movie_URL
    impo_audience = str(impo_audinece).replace(',','')
NameError: name 'impo_audinece' is not defined
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 96, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 67, in Online_Movie
    Online_Movie_URL(result)
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 56, in Online_Movie_URL
    result.append(impo_title + impo_release + impo_genre + impo_audience)
TypeError: can only concatenate list (not "str") to list
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324002 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085092 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921903 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
10298743

<class 'str'>
6880546

<class 'str'>
14411775

<class 'str'>
16265618

<class 'str'>
13414484

<class 'str'>
6879989

<class 'str'>
4684571

<class 'str'>
2452245

<class 'str'>
9135806

<class 'str'>
2636385

<class 'str'>
12984692

<class 'str'>
6975631

<class 'str'>
11212710

<class 'str'>
12706819

<class 'str'>
12811624

<class 'str'>
9707581

<class 'str'>
17615658

<class 'str'>
12276350

<class 'str'>
3189091

<class 'str'>
11567662

<class 'str'>
7075607

<class 'str'>
5546823

<class 'str'>
4720050

<class 'str'>
8660623

<class 'str'>
7817654

<class 'str'>
2310206

<class 'str'>
6129681

<class 'str'>
2971475

<class 'str'>
12189654

<class 'str'>
5294154

<class 'str'>
14263578

<class 'str'>
5653444

<class 'str'>
2084909

<class 'str'>
4706158

<class 'str'>
5063844

<class 'str'>
1110274

<class 'str'>
1593386

<class 'str'>
2625636

<class 'str'>
4288908

<class 'str'>
4452850

<class 'str'>
11375123

<class 'str'>
1051710

<class 'str'>
4113696

<class 'str'>
7232387

<class 'str'>
3317196

<class 'str'>
8666208

<class 'str'>
4018341

<class 'str'>
2931897

<class 'str'>
5317959

<class 'str'>
446054

<class 'str'>
5447269

<class 'str'>
10085092

<class 'str'>
5661128

<class 'str'>
2594695

<class 'str'>
3789553

<class 'str'>
6044956

<class 'str'>
3897969

<class 'str'>
5441020

<class 'str'>
4015361

<class 'str'>
6247651

<class 'str'>
4945484

<class 'str'>
7166688

<class 'str'>
4858572

<class 'str'>
5399327

<class 'str'>
7258678

<class 'str'>
1346511

<class 'str'>
3689325

<class 'str'>
3566852

<class 'str'>
7120780

<class 'str'>
3513114

<class 'str'>
4598985

<class 'str'>
3420116

<class 'str'>
2860786

<class 'str'>
7150586

<class 'str'>
1441990

<class 'str'>
4881865

<class 'str'>
3849700

<class 'str'>
9001679

<class 'str'>
10494840

<class 'str'>
7073516

<class 'str'>
2812427

<class 'str'>
3601434

<class 'str'>
931953

<class 'str'>
7500457

<class 'str'>
6592151

<class 'str'>
3755233

<class 'str'>
5443232

<class 'str'>
2625686

<class 'str'>
2654817

<class 'str'>
4775811

<class 'str'>
3888096

<class 'str'>
5038154

<class 'str'>
1917999

<class 'str'>
5311353

<class 'str'>
6959083

<class 'str'>
6584915

<class 'str'>
4969735

<class 'str'>
3152895

<class 'str'>
4975517

<class 'str'>
2718237

<class 'str'>
963763

<class 'str'>
5509019

<class 'str'>
5604106

<class 'str'>
3611166

<class 'str'>
9352448

<class 'str'>
1826912

<class 'str'>
7759761

<class 'str'>
2318748

<class 'str'>
6655068

<class 'str'>
1128774

<class 'str'>
5237525

<class 'str'>
2736060

<class 'str'>
4131338

<class 'str'>
1744585

<class 'str'>
1515356

<class 'str'>
3450305

<class 'str'>
8678117

<class 'str'>
3407564

<class 'str'>
6126488

<class 'str'>
3248904

<class 'str'>
4667179

<class 'str'>
1864076

<class 'str'>
10309432

<class 'str'>
3849129

<class 'str'>
1094404

<class 'str'>
1344599

<class 'str'>
1166025

<class 'str'>
1462561

<class 'str'>
4585116

<class 'str'>
4516063

<class 'str'>
2982514

<class 'str'>
461693

<class 'str'>
3784602

<class 'str'>
2588628

<class 'str'>
2564340

<class 'str'>
1711246

<class 'str'>
2801949

<class 'str'>
3117859

<class 'str'>
3389125

<class 'str'>
3653238

<class 'str'>
3984814

<class 'str'>
1629528

<class 'str'>
2744413

<class 'str'>
3240370

<class 'str'>
7508976

<class 'str'>
608273

<class 'str'>
988451

<class 'str'>
2058096

<class 'str'>
1492903

<class 'str'>
1646142

<class 'str'>
1635003

<class 'str'>
2515590

<class 'str'>
2138524

<class 'str'>
4909950

<class 'str'>
2434435

<class 'str'>
1974893

<class 'str'>
2675883

<class 'str'>
1385511

<class 'str'>
4853273

<class 'str'>
1110523

<class 'str'>
5921903

<class 'str'>
1967721

<class 'str'>
958498

<class 'str'>
9948386

<class 'str'>
346483

<class 'str'>
2524720

<class 'str'>
364415

<class 'str'>
2847712

<class 'str'>
3000115

<class 'str'>
2108561

<class 'str'>
2938818

<class 'str'>
2520700

<class 'str'>
5295836

<class 'str'>
1831741

<class 'str'>
9425630

<class 'str'>
2262758

<class 'str'>
3040115

<class 'str'>
2006561

<class 'str'>
3445658

<class 'str'>
4787227

<class 'str'>
3324874

<class 'str'>
1208081

<class 'str'>
1762742

<class 'str'>
2087474

<class 'str'>
2611966

<class 'str'>
1246185

<class 'str'>
13934592

<class 'str'>
592435

<class 'str'>
953682

<class 'str'>
3436092

<class 'str'>
2729827

<class 'str'>
2051386

<class 'str'>
2394487

<class 'str'>
1593694

<class 'str'>
4002560

<class 'str'>
2950097

<class 'str'>
2051315

<class 'str'>
3872015

<class 'str'>
1855515

<class 'str'>
5181244

<class 'str'>
137788

<class 'str'>
2308646

<class 'str'>
1722017

<class 'str'>
4313871

<class 'str'>
3100113

<class 'str'>
3283434

<class 'str'>
1855917

<class 'str'>
5138328

<class 'str'>
2007665

<class 'str'>
1362114

<class 'str'>
1689717

<class 'str'>
2095592

<class 'str'>
612328

<class 'str'>
2241687

<class 'str'>
2192525

<class 'str'>
2444136

<class 'str'>
3715089

<class 'str'>
2165401

<class 'str'>
5448134

<class 'str'>
2841884

<class 'str'>
1472147

<class 'str'>
2614601

<class 'str'>
4058225

<class 'str'>
450378

<class 'str'>
73483

<class 'str'>
1515104

<class 'str'>
3884130

<class 'str'>
1676040

<class 'str'>
2718158

<class 'str'>
2475797

<class 'str'>
2436884

<class 'str'>
1160021

<class 'str'>
1599598

<class 'str'>
1028384

<class 'str'>
2169109

<class 'str'>
1015392

<class 'str'>
1898220

<class 'str'>
277370

<class 'str'>
262233

<class 'str'>
1310895

<class 'str'>
2299732

<class 'str'>
1141222

<class 'str'>
884988

<class 'str'>
0

<class 'str'>
3963964

<class 'str'>
1128288

<class 'str'>
1330183

<class 'str'>
6399303

<class 'str'>
3044859

<class 'str'>
5802811

<class 'str'>
2601761

<class 'str'>
4168353

<class 'str'>
2963652

<class 'str'>
1127373

<class 'str'>
5835017

<class 'str'>
1231261

<class 'str'>
558443

<class 'str'>
4662926

<class 'str'>
2534748

<class 'str'>
272062

<class 'str'>
1500830

<class 'str'>
2711094

<class 'str'>
110771

<class 'str'>
1790916

<class 'str'>
4699307

<class 'str'>
1730773

<class 'str'>
870759

<class 'str'>
1403019

<class 'str'>
1764233

<class 'str'>
1338411

<class 'str'>
1163274

<class 'str'>
2658589

<class 'str'>
2985556

<class 'str'>
1775033

<class 'str'>
1307226

<class 'str'>
2192276

<class 'str'>
919202

<class 'str'>
768442

<class 'str'>
0

<class 'str'>
3033105

<class 'str'>
3430975

<class 'str'>
837500

<class 'str'>
1552055

<class 'str'>
790181

<class 'str'>
103628

<class 'str'>
3579666

<class 'str'>
2866453

<class 'str'>
2254430

<class 'str'>
844

<class 'str'>
1786386

<class 'str'>
1461

<class 'str'>
537920

<class 'str'>
223740

<class 'str'>
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 96, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 73, in Online_Movie
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 87, in Analysis
    if line[3]==genre[i]:
IndexError: list index out of range
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324002 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085092 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921903 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 99, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 70, in Online_Movie
    movie_table.to_csv("./Online_Movie.csv", encoding="cp949", mode='w', index=True)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\generic.py", line 3228, in to_csv
    formatter.save()
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\io\formats\csvs.py", line 183, in save
    compression=self.compression,
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\io\common.py", line 399, in _get_handle
    f = open(path_or_buf, mode, encoding=encoding, newline="")
PermissionError: [Errno 13] Permission denied: './Online_Movie.csv'
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324002 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085092 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921903 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 99, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 70, in Online_Movie
    movie_table.to_csv("./Online_Movie.csv", encoding="cp949", mode='w', index=True)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\generic.py", line 3228, in to_csv
    formatter.save()
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\io\formats\csvs.py", line 183, in save
    compression=self.compression,
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\io\common.py", line 399, in _get_handle
    f = open(path_or_buf, mode, encoding=encoding, newline="")
PermissionError: [Errno 13] Permission denied: './Online_Movie.csv'
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324002 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085092 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921903 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 96, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 70, in Online_Movie
    movie_table.to_csv("./Online_Movie.csv", encoding="cp949", mode='w', index=True)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\generic.py", line 3228, in to_csv
    formatter.save()
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\io\formats\csvs.py", line 183, in save
    compression=self.compression,
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\io\common.py", line 399, in _get_handle
    f = open(path_or_buf, mode, encoding=encoding, newline="")
PermissionError: [Errno 13] Permission denied: './Online_Movie.csv'
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324002 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085092 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921905 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
10298743

<class 'str'>
6880546

<class 'str'>
14411775

<class 'str'>
16265618

<class 'str'>
13414484

<class 'str'>
6879989

<class 'str'>
4684571

<class 'str'>
2452245

<class 'str'>
9135806

<class 'str'>
2636385

<class 'str'>
12984692

<class 'str'>
6975631

<class 'str'>
11212710

<class 'str'>
12706819

<class 'str'>
12811624

<class 'str'>
9707581

<class 'str'>
17615658

<class 'str'>
12276350

<class 'str'>
3189091

<class 'str'>
11567662

<class 'str'>
7075607

<class 'str'>
5546823

<class 'str'>
4720050

<class 'str'>
8660623

<class 'str'>
7817654

<class 'str'>
2310206

<class 'str'>
6129681

<class 'str'>
2971475

<class 'str'>
12189654

<class 'str'>
5294154

<class 'str'>
14263578

<class 'str'>
5653444

<class 'str'>
2084909

<class 'str'>
4706158

<class 'str'>
5063844

<class 'str'>
1110274

<class 'str'>
1593386

<class 'str'>
2625636

<class 'str'>
4288908

<class 'str'>
4452850

<class 'str'>
11375123

<class 'str'>
1051710

<class 'str'>
4113696

<class 'str'>
7232387

<class 'str'>
3317196

<class 'str'>
8666208

<class 'str'>
4018341

<class 'str'>
2931897

<class 'str'>
5317959

<class 'str'>
446054

<class 'str'>
5447269

<class 'str'>
10085092

<class 'str'>
5661128

<class 'str'>
2594695

<class 'str'>
3789553

<class 'str'>
6044956

<class 'str'>
3897969

<class 'str'>
5441020

<class 'str'>
4015361

<class 'str'>
6247651

<class 'str'>
4945484

<class 'str'>
7166688

<class 'str'>
4858572

<class 'str'>
5399327

<class 'str'>
7258678

<class 'str'>
1346511

<class 'str'>
3689325

<class 'str'>
3566852

<class 'str'>
7120780

<class 'str'>
3513114

<class 'str'>
4598985

<class 'str'>
3420116

<class 'str'>
2860786

<class 'str'>
7150586

<class 'str'>
1441990

<class 'str'>
4881865

<class 'str'>
3849700

<class 'str'>
9001679

<class 'str'>
10494840

<class 'str'>
7073516

<class 'str'>
2812427

<class 'str'>
3601434

<class 'str'>
931953

<class 'str'>
7500457

<class 'str'>
6592151

<class 'str'>
3755233

<class 'str'>
5443232

<class 'str'>
2625686

<class 'str'>
2654817

<class 'str'>
4775811

<class 'str'>
3888096

<class 'str'>
5038154

<class 'str'>
1917999

<class 'str'>
5311353

<class 'str'>
6959083

<class 'str'>
6584915

<class 'str'>
4969735

<class 'str'>
3152895

<class 'str'>
4975517

<class 'str'>
2718237

<class 'str'>
963763

<class 'str'>
5509019

<class 'str'>
5604106

<class 'str'>
3611166

<class 'str'>
9352448

<class 'str'>
1826912

<class 'str'>
7759761

<class 'str'>
2318748

<class 'str'>
6655068

<class 'str'>
1128774

<class 'str'>
5237525

<class 'str'>
2736060

<class 'str'>
4131338

<class 'str'>
1744585

<class 'str'>
1515356

<class 'str'>
3450305

<class 'str'>
8678117

<class 'str'>
3407564

<class 'str'>
6126488

<class 'str'>
3248904

<class 'str'>
4667179

<class 'str'>
1864076

<class 'str'>
10309432

<class 'str'>
3849129

<class 'str'>
1094404

<class 'str'>
1344599

<class 'str'>
1166025

<class 'str'>
1462561

<class 'str'>
4585116

<class 'str'>
4516063

<class 'str'>
2982514

<class 'str'>
461693

<class 'str'>
3784602

<class 'str'>
2588628

<class 'str'>
2564340

<class 'str'>
1711246

<class 'str'>
2801949

<class 'str'>
3117859

<class 'str'>
3389125

<class 'str'>
3653238

<class 'str'>
3984814

<class 'str'>
1629528

<class 'str'>
2744413

<class 'str'>
3240370

<class 'str'>
7508976

<class 'str'>
608273

<class 'str'>
988451

<class 'str'>
2058096

<class 'str'>
1492903

<class 'str'>
1646142

<class 'str'>
1635003

<class 'str'>
2515590

<class 'str'>
2138524

<class 'str'>
4909950

<class 'str'>
2434435

<class 'str'>
1974893

<class 'str'>
2675883

<class 'str'>
1385511

<class 'str'>
4853273

<class 'str'>
1110523

<class 'str'>
5921905

<class 'str'>
1967721

<class 'str'>
958498

<class 'str'>
9948386

<class 'str'>
346483

<class 'str'>
2524720

<class 'str'>
364415

<class 'str'>
2847712

<class 'str'>
3000115

<class 'str'>
2108561

<class 'str'>
2938818

<class 'str'>
2520700

<class 'str'>
5295836

<class 'str'>
1831741

<class 'str'>
9425630

<class 'str'>
2262758

<class 'str'>
3040115

<class 'str'>
2006561

<class 'str'>
3445658

<class 'str'>
4787227

<class 'str'>
3324874

<class 'str'>
1208081

<class 'str'>
1762742

<class 'str'>
2087474

<class 'str'>
2611966

<class 'str'>
1246185

<class 'str'>
13934592

<class 'str'>
592435

<class 'str'>
953682

<class 'str'>
3436092

<class 'str'>
2729827

<class 'str'>
2051386

<class 'str'>
2394487

<class 'str'>
1593694

<class 'str'>
4002560

<class 'str'>
2950097

<class 'str'>
2051315

<class 'str'>
3872015

<class 'str'>
1855515

<class 'str'>
5181244

<class 'str'>
137788

<class 'str'>
2308646

<class 'str'>
1722017

<class 'str'>
4313871

<class 'str'>
3100113

<class 'str'>
3283434

<class 'str'>
1855917

<class 'str'>
5138328

<class 'str'>
2007665

<class 'str'>
1362114

<class 'str'>
1689717

<class 'str'>
2095592

<class 'str'>
612328

<class 'str'>
2241687

<class 'str'>
2192525

<class 'str'>
2444136

<class 'str'>
3715089

<class 'str'>
2165401

<class 'str'>
5448134

<class 'str'>
2841884

<class 'str'>
1472147

<class 'str'>
2614601

<class 'str'>
4058225

<class 'str'>
450378

<class 'str'>
73483

<class 'str'>
1515104

<class 'str'>
3884130

<class 'str'>
1676040

<class 'str'>
2718158

<class 'str'>
2475797

<class 'str'>
2436884

<class 'str'>
1160021

<class 'str'>
1599598

<class 'str'>
1028384

<class 'str'>
2169109

<class 'str'>
1015392

<class 'str'>
1898220

<class 'str'>
277370

<class 'str'>
262233

<class 'str'>
1310895

<class 'str'>
2299732

<class 'str'>
1141222

<class 'str'>
884988

<class 'str'>
0

<class 'str'>
3963964

<class 'str'>
1128288

<class 'str'>
1330183

<class 'str'>
6399303

<class 'str'>
3044859

<class 'str'>
5802811

<class 'str'>
2601761

<class 'str'>
4168353

<class 'str'>
2963652

<class 'str'>
1127373

<class 'str'>
5835017

<class 'str'>
1231261

<class 'str'>
558443

<class 'str'>
4662926

<class 'str'>
2534748

<class 'str'>
272062

<class 'str'>
1500830

<class 'str'>
2711094

<class 'str'>
110771

<class 'str'>
1790916

<class 'str'>
4699307

<class 'str'>
1730773

<class 'str'>
870759

<class 'str'>
1403019

<class 'str'>
1764233

<class 'str'>
1338411

<class 'str'>
1163274

<class 'str'>
2658589

<class 'str'>
2985556

<class 'str'>
1775033

<class 'str'>
1307226

<class 'str'>
2192276

<class 'str'>
919202

<class 'str'>
768442

<class 'str'>
0

<class 'str'>
3033105

<class 'str'>
3430975

<class 'str'>
837500

<class 'str'>
1552055

<class 'str'>
790181

<class 'str'>
103628

<class 'str'>
3579666

<class 'str'>
2866453

<class 'str'>
2254430

<class 'str'>
844

<class 'str'>
1786386

<class 'str'>
1461

<class 'str'>
537920

<class 'str'>
223740

<class 'str'>
[69205702, 100197358, 35222568, 98405898, 418838957, 22219409, 77041749, 187435277, 22498213, 29857814, 15341052, 23748713, 11593228, 1855515]
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324002 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085092 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921905 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
10298743

<class 'str'>
6880546

<class 'str'>
14411775

<class 'str'>
16265618

<class 'str'>
13414484

<class 'str'>
6879989

<class 'str'>
4684571

<class 'str'>
2452245

<class 'str'>
9135806

<class 'str'>
2636385

<class 'str'>
12984692

<class 'str'>
6975631

<class 'str'>
11212710

<class 'str'>
12706819

<class 'str'>
12811624

<class 'str'>
9707581

<class 'str'>
17615658

<class 'str'>
12276350

<class 'str'>
3189091

<class 'str'>
11567662

<class 'str'>
7075607

<class 'str'>
5546823

<class 'str'>
4720050

<class 'str'>
8660623

<class 'str'>
7817654

<class 'str'>
2310206

<class 'str'>
6129681

<class 'str'>
2971475

<class 'str'>
12189654

<class 'str'>
5294154

<class 'str'>
14263578

<class 'str'>
5653444

<class 'str'>
2084909

<class 'str'>
4706158

<class 'str'>
5063844

<class 'str'>
1110274

<class 'str'>
1593386

<class 'str'>
2625636

<class 'str'>
4288908

<class 'str'>
4452850

<class 'str'>
11375123

<class 'str'>
1051710

<class 'str'>
4113696

<class 'str'>
7232387

<class 'str'>
3317196

<class 'str'>
8666208

<class 'str'>
4018341

<class 'str'>
2931897

<class 'str'>
5317959

<class 'str'>
446054

<class 'str'>
5447269

<class 'str'>
10085092

<class 'str'>
5661128

<class 'str'>
2594695

<class 'str'>
3789553

<class 'str'>
6044956

<class 'str'>
3897969

<class 'str'>
5441020

<class 'str'>
4015361

<class 'str'>
6247651

<class 'str'>
4945484

<class 'str'>
7166688

<class 'str'>
4858572

<class 'str'>
5399327

<class 'str'>
7258678

<class 'str'>
1346511

<class 'str'>
3689325

<class 'str'>
3566852

<class 'str'>
7120780

<class 'str'>
3513114

<class 'str'>
4598985

<class 'str'>
3420116

<class 'str'>
2860786

<class 'str'>
7150586

<class 'str'>
1441990

<class 'str'>
4881865

<class 'str'>
3849700

<class 'str'>
9001679

<class 'str'>
10494840

<class 'str'>
7073516

<class 'str'>
2812427

<class 'str'>
3601434

<class 'str'>
931953

<class 'str'>
7500457

<class 'str'>
6592151

<class 'str'>
3755233

<class 'str'>
5443232

<class 'str'>
2625686

<class 'str'>
2654817

<class 'str'>
4775811

<class 'str'>
3888096

<class 'str'>
5038154

<class 'str'>
1917999

<class 'str'>
5311353

<class 'str'>
6959083

<class 'str'>
6584915

<class 'str'>
4969735

<class 'str'>
3152895

<class 'str'>
4975517

<class 'str'>
2718237

<class 'str'>
963763

<class 'str'>
5509019

<class 'str'>
5604106

<class 'str'>
3611166

<class 'str'>
9352448

<class 'str'>
1826912

<class 'str'>
7759761

<class 'str'>
2318748

<class 'str'>
6655068

<class 'str'>
1128774

<class 'str'>
5237525

<class 'str'>
2736060

<class 'str'>
4131338

<class 'str'>
1744585

<class 'str'>
1515356

<class 'str'>
3450305

<class 'str'>
8678117

<class 'str'>
3407564

<class 'str'>
6126488

<class 'str'>
3248904

<class 'str'>
4667179

<class 'str'>
1864076

<class 'str'>
10309432

<class 'str'>
3849129

<class 'str'>
1094404

<class 'str'>
1344599

<class 'str'>
1166025

<class 'str'>
1462561

<class 'str'>
4585116

<class 'str'>
4516063

<class 'str'>
2982514

<class 'str'>
461693

<class 'str'>
3784602

<class 'str'>
2588628

<class 'str'>
2564340

<class 'str'>
1711246

<class 'str'>
2801949

<class 'str'>
3117859

<class 'str'>
3389125

<class 'str'>
3653238

<class 'str'>
3984814

<class 'str'>
1629528

<class 'str'>
2744413

<class 'str'>
3240370

<class 'str'>
7508976

<class 'str'>
608273

<class 'str'>
988451

<class 'str'>
2058096

<class 'str'>
1492903

<class 'str'>
1646142

<class 'str'>
1635003

<class 'str'>
2515590

<class 'str'>
2138524

<class 'str'>
4909950

<class 'str'>
2434435

<class 'str'>
1974893

<class 'str'>
2675883

<class 'str'>
1385511

<class 'str'>
4853273

<class 'str'>
1110523

<class 'str'>
5921905

<class 'str'>
1967721

<class 'str'>
958498

<class 'str'>
9948386

<class 'str'>
346483

<class 'str'>
2524720

<class 'str'>
364415

<class 'str'>
2847712

<class 'str'>
3000115

<class 'str'>
2108561

<class 'str'>
2938818

<class 'str'>
2520700

<class 'str'>
5295836

<class 'str'>
1831741

<class 'str'>
9425630

<class 'str'>
2262758

<class 'str'>
3040115

<class 'str'>
2006561

<class 'str'>
3445658

<class 'str'>
4787227

<class 'str'>
3324874

<class 'str'>
1208081

<class 'str'>
1762742

<class 'str'>
2087474

<class 'str'>
2611966

<class 'str'>
1246185

<class 'str'>
13934592

<class 'str'>
592435

<class 'str'>
953682

<class 'str'>
3436092

<class 'str'>
2729827

<class 'str'>
2051386

<class 'str'>
2394487

<class 'str'>
1593694

<class 'str'>
4002560

<class 'str'>
2950097

<class 'str'>
2051315

<class 'str'>
3872015

<class 'str'>
1855515

<class 'str'>
5181244

<class 'str'>
137788

<class 'str'>
2308646

<class 'str'>
1722017

<class 'str'>
4313871

<class 'str'>
3100113

<class 'str'>
3283434

<class 'str'>
1855917

<class 'str'>
5138328

<class 'str'>
2007665

<class 'str'>
1362114

<class 'str'>
1689717

<class 'str'>
2095592

<class 'str'>
612328

<class 'str'>
2241687

<class 'str'>
2192525

<class 'str'>
2444136

<class 'str'>
3715089

<class 'str'>
2165401

<class 'str'>
5448134

<class 'str'>
2841884

<class 'str'>
1472147

<class 'str'>
2614601

<class 'str'>
4058225

<class 'str'>
450378

<class 'str'>
73483

<class 'str'>
1515104

<class 'str'>
3884130

<class 'str'>
1676040

<class 'str'>
2718158

<class 'str'>
2475797

<class 'str'>
2436884

<class 'str'>
1160021

<class 'str'>
1599598

<class 'str'>
1028384

<class 'str'>
2169109

<class 'str'>
1015392

<class 'str'>
1898220

<class 'str'>
277370

<class 'str'>
262233

<class 'str'>
1310895

<class 'str'>
2299732

<class 'str'>
1141222

<class 'str'>
884988

<class 'str'>
0

<class 'str'>
3963964

<class 'str'>
1128288

<class 'str'>
1330183

<class 'str'>
6399303

<class 'str'>
3044859

<class 'str'>
5802811

<class 'str'>
2601761

<class 'str'>
4168353

<class 'str'>
2963652

<class 'str'>
1127373

<class 'str'>
5835017

<class 'str'>
1231261

<class 'str'>
558443

<class 'str'>
4662926

<class 'str'>
2534748

<class 'str'>
272062

<class 'str'>
1500830

<class 'str'>
2711094

<class 'str'>
110771

<class 'str'>
1790916

<class 'str'>
4699307

<class 'str'>
1730773

<class 'str'>
870759

<class 'str'>
1403019

<class 'str'>
1764233

<class 'str'>
1338411

<class 'str'>
1163274

<class 'str'>
2658589

<class 'str'>
2985556

<class 'str'>
1775033

<class 'str'>
1307226

<class 'str'>
2192276

<class 'str'>
919202

<class 'str'>
768442

<class 'str'>
0

<class 'str'>
3033105

<class 'str'>
3430975

<class 'str'>
837500

<class 'str'>
1552055

<class 'str'>
790181

<class 'str'>
103628

<class 'str'>
3579666

<class 'str'>
2866453

<class 'str'>
2254430

<class 'str'>
844

<class 'str'>
1786386

<class 'str'>
1461

<class 'str'>
537920

<class 'str'>
223740

<class 'str'>
애니메이션  :  69205702
범죄  :  100197358
판타지  :  35222568
코미디  :  98405898
액션  :  418838957
미스터리  :  22219409
사극  :  77041749
드라마  :  187435277
스릴러  :  22498213
멜로/로맨스  :  29857814
어드벤처  :  15341052
SF  :  23748713
공포(호러)  :  11593228
다큐멘터리  :  1855515
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921908 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
('애니메이션', ' : ', 69205702)
('범죄', ' : ', 100197358)
('판타지', ' : ', 35222568)
('코미디', ' : ', 98405898)
('액션', ' : ', 418838957)
('미스터리', ' : ', 22219409)
('사극', ' : ', 77041749)
('드라마', ' : ', 187435281)
('스릴러', ' : ', 22498213)
('멜로/로맨스', ' : ', 29857814)
('어드벤처', ' : ', 15341052)
('SF', ' : ', 23748713)
('공포(호러)', ' : ', 11593228)
('다큐멘터리', ' : ', 1855515)
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921908 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 100, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 72, in Online_Movie
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 96, in Analysis
    genre_counting = list(genre[i],' : ',counting[i])
TypeError: list expected at most 1 arguments, got 3
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921908 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 100, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 72, in Online_Movie
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 97, in Analysis
    print(list(genre[i],' : ',counting[i]))
TypeError: list expected at most 1 arguments, got 3
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921908 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
애니메이션  :  69205702
범죄  :  100197358
판타지  :  35222568
코미디  :  98405898
액션  :  418838957
미스터리  :  22219409
사극  :  77041749
드라마  :  187435281
스릴러  :  22498213
멜로/로맨스  :  29857814
어드벤처  :  15341052
SF  :  23748713
공포(호러)  :  11593228
다큐멘터리  :  1855515
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921908 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['애니메이션', ' : ', 69205702]
['범죄', ' : ', 100197358]
['판타지', ' : ', 35222568]
['코미디', ' : ', 98405898]
['액션', ' : ', 418838957]
['미스터리', ' : ', 22219409]
['사극', ' : ', 77041749]
['드라마', ' : ', 187435281]
['스릴러', ' : ', 22498213]
['멜로/로맨스', ' : ', 29857814]
['어드벤처', ' : ', 15341052]
['SF', ' : ', 23748713]
['공포(호러)', ' : ', 11593228]
['다큐멘터리', ' : ', 1855515]
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921908 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[['애니메이션', ' : ', 69205702]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409], ['사극', ' : ', 77041749]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409], ['사극', ' : ', 77041749], ['드라마', ' : ', 187435281]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409], ['사극', ' : ', 77041749], ['드라마', ' : ', 187435281], ['스릴러', ' : ', 22498213]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409], ['사극', ' : ', 77041749], ['드라마', ' : ', 187435281], ['스릴러', ' : ', 22498213], ['멜로/로맨스', ' : ', 29857814]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409], ['사극', ' : ', 77041749], ['드라마', ' : ', 187435281], ['스릴러', ' : ', 22498213], ['멜로/로맨스', ' : ', 29857814], ['어드벤처', ' : ', 15341052]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409], ['사극', ' : ', 77041749], ['드라마', ' : ', 187435281], ['스릴러', ' : ', 22498213], ['멜로/로맨스', ' : ', 29857814], ['어드벤처', ' : ', 15341052], ['SF', ' : ', 23748713]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409], ['사극', ' : ', 77041749], ['드라마', ' : ', 187435281], ['스릴러', ' : ', 22498213], ['멜로/로맨스', ' : ', 29857814], ['어드벤처', ' : ', 15341052], ['SF', ' : ', 23748713], ['공포(호러)', ' : ', 11593228]]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409], ['사극', ' : ', 77041749], ['드라마', ' : ', 187435281], ['스릴러', ' : ', 22498213], ['멜로/로맨스', ' : ', 29857814], ['어드벤처', ' : ', 15341052], ['SF', ' : ', 23748713], ['공포(호러)', ' : ', 11593228], ['다큐멘터리', ' : ', 1855515]]
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921908 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[['애니메이션', ' : ', 69205702], ['범죄', ' : ', 100197358], ['판타지', ' : ', 35222568], ['코미디', ' : ', 98405898], ['액션', ' : ', 418838957], ['미스터리', ' : ', 22219409], ['사극', ' : ', 77041749], ['드라마', ' : ', 187435281], ['스릴러', ' : ', 22498213], ['멜로/로맨스', ' : ', 29857814], ['어드벤처', ' : ', 15341052], ['SF', ' : ', 23748713], ['공포(호러)', ' : ', 11593228], ['다큐멘터리', ' : ', 1855515]]
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921908 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[['애니메이션', 69205702], ['범죄', 100197358], ['판타지', 35222568], ['코미디', 98405898], ['액션', 418838957], ['미스터리', 22219409], ['사극', 77041749], ['드라마', 187435281], ['스릴러', 22498213], ['멜로/로맨스', 29857814], ['어드벤처', 15341052], ['SF', 23748713], ['공포(호러)', 11593228], ['다큐멘터리', 1855515]]
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921908 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 100, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 72, in Online_Movie
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 96, in Analysis
    genre_counting.append(genre[i] + counting[i])
TypeError: can only concatenate str (not "int") to str
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921910 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['애니메이션69205702', '범죄100197358', '판타지35222568', '코미디98405898', '액션418838957', '미스터리22219409', '사극77041749', '드라마187435283', '스릴러22498213', '멜로/로맨스29857814', '어드벤처15341052', 'SF23748713', '공포(호러)11593228', '다큐멘터리1855515']
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085093 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921910 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['애니메이션69205702', '범죄100197358', '판타지35222568', '코미디98405898', '액션418838957', '미스터리22219409', '사극77041749', '드라마187435283', '스릴러22498213', '멜로/로맨스29857814', '어드벤처15341052', 'SF23748713', '공포(호러)11593228', '다큐멘터리1855515']
Traceback (most recent call last):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\managers.py", line 1678, in create_block_manager_from_blocks
    make_block(values=blocks[0], placement=slice(0, len(axes[0])))
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\blocks.py", line 3284, in make_block
    return klass(values, ndim=ndim, placement=placement)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\blocks.py", line 2792, in __init__
    super().__init__(values, ndim=ndim, placement=placement)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\blocks.py", line 128, in __init__
    "{mgr}".format(val=len(self.values), mgr=len(self.mgr_locs))
ValueError: Wrong number of items passed 1, placement implies 2

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 102, in <module>
    Online_Movie()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 72, in Online_Movie
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 98, in Analysis
    genre_table = pd.DataFrame(genre_counting, columns=('장르', '장르별누적관객수'))
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\frame.py", line 464, in __init__
    mgr = init_ndarray(data, index, columns, dtype=dtype, copy=copy)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\construction.py", line 213, in init_ndarray
    return create_block_manager_from_blocks(block_values, [columns, index])
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\managers.py", line 1688, in create_block_manager_from_blocks
    construction_error(tot_items, blocks[0].shape[1:], axes, e)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\managers.py", line 1719, in construction_error
    "Shape of passed values is {0}, indices imply {1}".format(passed, implied)
ValueError: Shape of passed values is (14, 1), indices imply (14, 2)
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085091 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921911 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['애니메이션69205702', '범죄100197358', '판타지35222568', '코미디98405898', '액션418838957', '미스터리22219409', '사극77041749', '드라마187435282', '스릴러22498213', '멜로/로맨스29857814', '어드벤처15341052', 'SF23748713', '공포(호러)11593228', '다큐멘터리1855515']
Traceback (most recent call last):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\managers.py", line 1678, in create_block_manager_from_blocks
    make_block(values=blocks[0], placement=slice(0, len(axes[0])))
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\blocks.py", line 3284, in make_block
    return klass(values, ndim=ndim, placement=placement)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\blocks.py", line 2792, in __init__
    super().__init__(values, ndim=ndim, placement=placement)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\blocks.py", line 128, in __init__
    "{mgr}".format(val=len(self.values), mgr=len(self.mgr_locs))
ValueError: Wrong number of items passed 1, placement implies 2

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 102, in <module>
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 97, in Analysis
    genre_table = pd.DataFrame(genre_counting, columns=('장르', '장르별누적관객수'))
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\frame.py", line 464, in __init__
    mgr = init_ndarray(data, index, columns, dtype=dtype, copy=copy)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\construction.py", line 213, in init_ndarray
    return create_block_manager_from_blocks(block_values, [columns, index])
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\managers.py", line 1688, in create_block_manager_from_blocks
    construction_error(tot_items, blocks[0].shape[1:], axes, e)
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\pandas\core\internals\managers.py", line 1719, in construction_error
    "Shape of passed values is {0}, indices imply {1}".format(passed, implied)
ValueError: Shape of passed values is (14, 1), indices imply (14, 2)
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085094 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921915 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085094 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921915 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
Traceback (most recent call last):
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 105, in <module>
    Analysis()
  File "D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py", line 99, in Analysis
    plt.ylim(1000000,420000000)
AttributeError: module 'matplotlib' has no attribute 'ylim'
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085098 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921915 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 50528 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 45768 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 47700 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 51060 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 49496 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 48276 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 51396 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 54032 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 53440 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 51648 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 53076 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 48120 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 46356 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 50529 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 49828 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 53552 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 47532 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 49324 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 44537 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 46300 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 46972 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 47560 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 47540 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 47084 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 47708 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 47196 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 47592 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 50612 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 48292 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 52376 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 44277 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 54252 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 54840 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 45796 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 53328 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 211
    font.set_text(s, 0.0, flags=flags)
RuntimeWarning: Glyph 47704 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 50528 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 45768 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 47700 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 51060 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 49496 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 48276 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 51396 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 54032 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 53440 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 51648 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 53076 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 48120 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 46356 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 50529 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 49828 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 53552 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 47532 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 49324 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 44537 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 46300 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 46972 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 47560 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 47540 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 47084 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 47708 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 47196 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 47592 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 50612 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 48292 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 52376 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 44277 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 54252 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 54840 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 45796 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 53328 missing from current font.

Warning (from warnings module):
  File "C:\Program Files (x86)\Microsoft Visual Studio\Shared\Python37_64\lib\site-packages\matplotlib\backends\backend_agg.py", line 180
    font.set_text(s, 0, flags=flags)
RuntimeWarning: Glyph 47704 missing from current font.
>>> 
============= RESTART: D:/데이터 크롤링/정인엽 크롤링/기말프로젝트/Online_Movie.py =============
ONLINE MOVIE LANKING START
['겨울왕국 (Frozen)'] 

['2014-01-16'] 

['애니메이션'] 

10298743 

['범죄도시 (THE OUTLAWS)'] 

['2017-10-03'] 

['범죄'] 

6880546 

['신과함께-죄와 벌 (Along with the Gods: The Two Worlds)'] 

['2017-12-20'] 

['판타지'] 

14411775 

['극한직업 (Extreme Job)'] 

['2019-01-23'] 

['코미디'] 

16265618 

['베테랑 (Veteran)'] 

['2015-08-05'] 

['액션'] 

13414484 

['곡성 (THE WAILING)'] 

['2016-05-12'] 

['미스터리'] 

6879989 

['신세계 (New World)'] 

['2013-02-21'] 

['범죄'] 

4684571 

['보스 베이비 (The Boss Baby)'] 

['2017-05-03'] 

['애니메이션'] 

2452245 

['관상 (The Face Reader)'] 

['2013-09-11'] 

['사극'] 

9135806 

['후궁 : 제왕의 첩 (The Concubine)'] 

['2012-06-06'] 

['사극'] 

2636385 

['도둑들 (The Thieves)'] 

['2012-07-25'] 

['액션'] 

12984692 

['럭키 (LUCK-KEY)'] 

['2016-10-13'] 

['코미디'] 

6975631 

['어벤져스: 인피니티 워 (Avengers: Infinity War)'] 

['2018-04-25'] 

['액션'] 

11212710 

['암살 (Assassination)'] 

['2015-07-22'] 

['액션'] 

12706819 

['광해, 왕이 된 남자 (Masquerade)'] 

['2012-09-13'] 

['사극'] 

12324062 

['7번방의 선물 (Miracle in Cell No.7)'] 

['2013-01-23'] 

['코미디'] 

12811624 

['검사외전 (A Violent Prosecutor)'] 

['2016-02-03'] 

['범죄'] 

9707581 

['명량 (Roaring Currents)'] 

['2014-07-30'] 

['사극'] 

17615658 

['신과함께-인과 연 (Along with the Gods: The Last 49 Days)'] 

['2018-08-01'] 

['판타지'] 

12276350 

['마녀 (The Witch : Part 1. The Subversion)'] 

['2018-06-27'] 

['미스터리'] 

3189091 

['부산행 (TRAIN TO BUSAN)'] 

['2016-07-20'] 

['액션'] 

11567662 

['어벤져스 (The Avengers)'] 

['2012-04-26'] 

['액션'] 

7075607 

['쥬라기 월드 (Jurassic World)'] 

['2015-06-11'] 

['액션'] 

5546823 

['범죄와의 전쟁: 나쁜놈들 전성시대 (Nameless Gangster : Rules of the Time)'] 

['2012-02-02'] 

['범죄'] 

4720050 

['수상한 그녀 (Miss Granny)'] 

['2014-01-22'] 

['드라마'] 

8660623 

['공조 (Confidential Assignment)'] 

['2017-01-18'] 

['액션'] 

7817654 

['모아나 (Moana )'] 

['2017-01-12'] 

['애니메이션'] 

2310206 

['킹스맨 : 시크릿 에이전트 (Kingsman: The Secret Service)'] 

['2015-02-11'] 

['액션'] 

6129681 

['친구 2 (Friend : The Great Legacy)'] 

['2013-11-14'] 

['액션'] 

2971475 

['택시운전사 (A Taxi Driver)'] 

['2017-08-02'] 

['드라마'] 

12189654 

['완벽한 타인 (Intimate Strangers)'] 

['2018-10-31'] 

['드라마'] 

5294154 

['국제시장 (Ode to My Father)'] 

['2014-12-17'] 

['드라마'] 

14263578 

['청년경찰 (Midnight Runners)'] 

['2017-08-09'] 

['액션'] 

5653444 

['내부자들: 디 오리지널 (Inside Men: The Original)'] 

['2015-12-31'] 

['범죄'] 

2084909 

['주토피아 (Zootopia)'] 

['2016-02-17'] 

['애니메이션'] 

4706158 

['독전 (Believer)'] 

['2018-05-22'] 

['범죄'] 

5063844 

['간신 (The Treacherous)'] 

['2015-05-21'] 

['사극'] 

1110274 

['악인전 (The Gangster, The Cop, The Devil)'] 

['2019-05-15'] 

['범죄'] 

3364712 

['성난황소 (Unstoppable)'] 

['2018-11-22'] 

['범죄'] 

1593386 

['미니언즈 (Minions)'] 

['2015-07-29'] 

['애니메이션'] 

2625636 

['아가씨 (The Handmaiden)'] 

['2016-06-01'] 

['스릴러'] 

4288908 

['강철비 (Steel Rain)'] 

['2017-12-14'] 

['액션'] 

4452850 

['변호인 (The Attorney)'] 

['2013-12-18'] 

['드라마'] 

11375123 

['점박이:한반도의 공룡3D (Speckles: The Tarbosaurus)'] 

['2012-01-26'] 

['애니메이션'] 

1051710 

['건축학개론 (Architecture 101)'] 

['2012-03-22'] 

['멜로/로맨스'] 

4113696 

['1987 (1987: When the Day Comes)'] 

['2017-12-27'] 

['드라마'] 

7232387 

['데드풀 (Deadpool)'] 

['2016-02-17'] 

['액션'] 

3317196 

['해적: 바다로 간 산적 (The Pirates )'] 

['2014-08-06'] 

['어드벤처'] 

8666208 

['꾼 (The Swindlers)'] 

['2017-11-22'] 

['범죄'] 

4018341 

['프리즌 (The Prison)'] 

['2017-03-23'] 

['범죄'] 

2931897 

['더 킹 (The King )'] 

['2017-01-18'] 

['범죄'] 

5317959 

['뽀로로 극장판 컴퓨터 왕국 대모험 (Pororo3 :  Cyber Space Adventure)'] 

['2015-12-10'] 

['애니메이션'] 

446054 

['닥터 스트레인지 (Doctor Strange)'] 

['2016-10-26'] 

['액션'] 

5447269 

['기생충 (PARASITE)'] 

['2019-05-30'] 

['드라마'] 

10085098 

['쥬라기 월드: 폴른 킹덤 (JURASSIC WORLD: FALLEN KINGDOM)'] 

['2018-06-06'] 

['액션'] 

5661128 

['아수라 (Asura : The City of Madness)'] 

['2016-09-28'] 

['범죄'] 

2594695 

['암수살인 (Dark Figure of Crime)'] 

['2018-10-03'] 

['범죄'] 

3789553 

['연평해전 (Northern Limit Line)'] 

['2015-06-24'] 

['드라마'] 

6044956 

['박수건달 (Man on the Edge)'] 

['2013-01-09'] 

['코미디'] 

3897969 

['안시성 (The Great Battle)'] 

['2018-09-19'] 

['사극'] 

5441020 

['타짜-신의 손 (Tazza-The Hidden Card)'] 

['2014-09-03'] 

['드라마'] 

4015361 

['사도 (The Throne)'] 

['2015-09-16'] 

['사극'] 

6247651 

['킹스맨: 골든 서클 (Kingsman: The Golden Circle)'] 

['2017-09-27'] 

['액션'] 

4945484 

['베를린 (The Berlin File)'] 

['2013-01-30'] 

['액션'] 

7166688 

['토르: 라그나로크 (THOR: RAGNAROK)'] 

['2017-10-25'] 

['액션'] 

4858572 

['블랙 팬서 (Black Panther)'] 

['2018-02-14'] 

['액션'] 

5399327 

['스파이더맨: 홈 커밍 (Spider-Man: Homecoming)'] 

['2017-07-05'] 

['액션'] 

7258678 

['은교 (Eungyo)'] 

['2012-04-25'] 

['멜로/로맨스'] 

1346511 

['미이라 (The Mummy)'] 

['2017-06-06'] 

['액션'] 

3689325 

['신의 한 수 (The Divine Move)'] 

['2014-07-03'] 

['범죄'] 

3566852 

['터널 (Tunnel)'] 

['2016-08-10'] 

['드라마'] 

7120780 

['코코 (COCO)'] 

['2018-01-11'] 

['애니메이션'] 

3513114 

['내 아내의 모든 것 (All About My Wife)'] 

['2012-05-17'] 

['코미디'] 

4598985 

['그것만이 내 세상 (Keys to the Heart)'] 

['2018-01-17'] 

['코미디'] 

3420116 

['극비수사 (The Classified File)'] 

['2015-06-18'] 

['드라마'] 

2860786 

['마스터 (Master)'] 

['2016-12-21'] 

['액션'] 

7150586 

['인간중독 (Obsessed)'] 

['2014-05-14'] 

['멜로/로맨스'] 

1441990 

['마션 (The Martian )'] 

['2015-10-08'] 

['액션'] 

4881865 

['역린 (The Fatal Encounter)'] 

['2014-04-30'] 

['사극'] 

3849700 

['아이언맨 3 (Iron Man 3)'] 

['2013-04-25'] 

['액션'] 

9001679 

['어벤져스: 에이지 오브 울트론 (The Avengers: Age of Ultron)'] 

['2015-04-23'] 

['액션'] 

10494840 

['내부자들 (Inside Men)'] 

['2015-11-19'] 

['범죄'] 

7073516 

['메이즈 러너 (The Maze Runner)'] 

['2014-09-18'] 

['액션'] 

2812427 

['라라랜드 (LA LA LAND)'] 

['2016-12-07'] 

['드라마'] 

3601434 

['뽀로로 극장판 슈퍼썰매 대모험 (Pororo: The Racing Adventure)'] 

['2013-01-23'] 

['애니메이션'] 

931953 

['밀정 (The Age of Shadows)'] 

['2016-09-07'] 

['액션'] 

7500457 

['군함도 (The Battleship Island)'] 

['2017-07-26'] 

['액션'] 

6592151 

['국가부도의 날 (Default)'] 

['2018-11-28'] 

['드라마'] 

3755233 

['검은 사제들 (The Priests)'] 

['2015-11-05'] 

['미스터리'] 

5443232 

['탐정 : 더 비기닝 (THE ACCIDENTAL DETECTIVE)'] 

['2015-09-24'] 

['코미디'] 

2625686 

['브레이킹 던 part2 (The Twilight Saga: Breaking Dawn Part 2)'] 

['2012-11-15'] 

['드라마'] 

2654817 

['군도: 민란의 시대 (KUNDO : Age of the Rampant)'] 

['2014-07-23'] 

['사극'] 

4775811 

['베놈 (Venom)'] 

['2018-10-03'] 

['액션'] 

3888096 

['아쿠아맨 (AQUAMAN)'] 

['2018-12-19'] 

['액션'] 

5038154 

['내안의 그놈 (The Dude in Me)'] 

['2019-01-09'] 

['판타지'] 

1917999 

['완득이 (Punch)'] 

['2011-10-20'] 

['드라마'] 

5311353 

['은밀하게 위대하게 (Secretly Greatly)'] 

['2013-06-05'] 

['액션'] 

6959083 

['미션 임파서블: 폴아웃 (Mission:Impossible- Fallout)'] 

['2018-07-25'] 

['액션'] 

6584915 

['인사이드 아웃 (Inside Out)'] 

['2015-07-09'] 

['애니메이션'] 

4969735 

['탐정: 리턴즈 (The Accidental Detective 2: In Action)'] 

['2018-06-13'] 

['코미디'] 

3152895 

['공작 (The Spy Gone North)'] 

['2018-08-08'] 

['드라마'] 

4975517 

['나우 유 씨 미 : 마술사기단 (Now You See Me )'] 

['2013-08-22'] 

['범죄'] 

2718237 

['슈퍼배드 2 (Despicable Me 2)'] 

['2013-09-12'] 

['애니메이션'] 

963763 

['감시자들 (Cold Eyes)'] 

['2013-07-03'] 

['범죄'] 

5509019 

['숨바꼭질 (Hide and Seek)'] 

['2013-08-14'] 

['스릴러'] 

5604106 

['인턴 (The Intern)'] 

['2015-09-24'] 

['코미디'] 

3611166 

['설국열차 (Snowpiercer)'] 

['2013-08-01'] 

['SF'] 

9352448 

['뺑반 (Hit-and-Run Squad)'] 

['2019-01-30'] 

['범죄'] 

1826912 

['히말라야 (The Himalayas)'] 

['2015-12-16'] 

['드라마'] 

7759761 

['스파이 (Spy)'] 

['2015-05-21'] 

['액션'] 

2318748 

['늑대소년 (A Werewolf Boy)'] 

['2012-10-31'] 

['멜로/로맨스'] 

6655068 

['챔피언 (Champion)'] 

['2018-05-01'] 

['드라마'] 

1128774 

['월드 워 Z (World War Z )'] 

['2013-06-20'] 

['드라마'] 

5237525 

['가디언즈 오브 갤럭시 VOL. 2 (Guardians of the Galaxy VOL. 2)'] 

['2017-05-03'] 

['액션'] 

2736060 

['용의자 (The Suspect)'] 

['2013-12-24'] 

['액션'] 

4131338 

['전설의 주먹 (Fists of Legend)'] 

['2013-04-10'] 

['드라마'] 

1744585 

['오블리비언 (Oblivion)'] 

['2013-04-11'] 

['액션'] 

1515356 

['끝까지 간다 (A Hard Day)'] 

['2014-05-29'] 

['액션'] 

3450305 

['캡틴 아메리카: 시빌 워 (Captain America: Civil War)'] 

['2016-04-27'] 

['액션'] 

8678117 

['어바웃 타임 (ABOUT TIME)'] 

['2013-12-05'] 

['멜로/로맨스'] 

3407564 

['미션 임파서블: 로그네이션 (Mission: Impossible - Rogue Nation)'] 

['2015-07-30'] 

['액션'] 

6126488 

['분노의 질주: 더 세븐 (Fast &amp; Furious 7)'] 

['2015-04-01'] 

['액션'] 

3248904 

['신비한 동물사전 (Fantastic Beasts and Where to Find Them)'] 

['2016-11-16'] 

['어드벤처'] 

4667179 

['마약왕 (The Drug King)'] 

['2018-12-19'] 

['범죄'] 

1864076 

['인터스텔라 (Interstellar)'] 

['2014-11-06'] 

['SF'] 

10309432 

['남한산성 (The Fortress)'] 

['2017-10-03'] 

['사극'] 

3849129 

['롱 리브 더 킹: 목포 영웅 (Long Live the King)'] 

['2019-06-19'] 

['액션'] 

1094404 

['가디언즈 오브 갤럭시 (Guardians of the Galaxy)'] 

['2014-07-31'] 

['액션'] 

1344599 

['돈의 맛 (The Taste of Money)'] 

['2012-05-17'] 

['드라마'] 

1166025 

['브레이킹 던 part1 (The Twilight Saga: Breaking Dawn - Part 1)'] 

['2011-11-30'] 

['드라마'] 

1462561 

['판도라 (Pandora)'] 

['2016-12-07'] 

['드라마'] 

4585116 

['연가시 (Deranged)'] 

['2012-07-05'] 

['공포(호러)'] 

4516063 

['형 (MY ANNOYING BROTHER)'] 

['2016-11-23'] 

['코미디'] 

2982514 

['동네사람들 (Ordinary People)'] 

['2018-11-07'] 

['액션'] 

461693 

['데드풀 2 (DEADPOOL 2)'] 

['2018-05-16'] 

['액션'] 

3784602 

['보안관 (The Sheriff In Town)'] 

['2017-05-03'] 

['범죄'] 

2588628 

['기술자들 (The Con Artists)'] 

['2014-12-24'] 

['범죄'] 

2564340 

['쥬만지: 새로운 세계 (Jumanji: Welcome to the Jungle)'] 

['2018-01-03'] 

['액션'] 

1711246 

['해리포터와 마법사의 돌 (Harry Potter And The Socrerers Stone)'] 

['2001-12-13'] 

['가족'] 

267950 

['빅 히어로 (Big Hero 6)'] 

['2015-01-21'] 

['애니메이션'] 

2801949 

['감기 (Flu)'] 

['2013-08-14'] 

['드라마'] 

3117859 

['돈 (Money)'] 

['2019-03-20'] 

['범죄'] 

3389125 

['분노의 질주: 더 익스트림 (Fast and Furious 8)'] 

['2017-04-12'] 

['액션'] 

3653238 

['쿵푸팬더3 (Kung Fu Panda 3)'] 

['2016-01-28'] 

['애니메이션'] 

3984814 

['걸캅스 (Miss &amp; Mrs. Cops)'] 

['2019-05-09'] 

['코미디'] 

1629528 

['메이즈 러너: 스코치 트라이얼 (Maze Runner: The Scorch Trials)'] 

['2015-09-16'] 

['액션'] 

2744413 

['터미네이터 제니시스 (Terminator Genisys)'] 

['2015-07-02'] 

['액션'] 

3240370 

['더 테러 라이브 (The Terror, LIVE)'] 

['2013-07-31'] 

['범죄'] 

5584295 

['인천상륙작전 (Operation Chromite )'] 

['2016-07-27'] 

['전쟁'] 

7051237 

['뽀로로 극장판 공룡섬 대모험 (Pororo, Dinosaur Island Adventure)'] 

['2017-12-07'] 

['애니메이션'] 

827338 

['미션임파서블:고스트프로토콜 (Mission: Impossible: Ghost Protocol)'] 

['2011-12-15'] 

['액션'] 

7508976 

['헝거게임: 판엠의 불꽃 (The Hunger Games)'] 

['2012-04-05'] 

['액션'] 

608273 

['미쓰 와이프 (Wonderful Nightmare)'] 

['2015-08-13'] 

['코미디'] 

988451 

['뷰티 인사이드 (The Beauty Inside)'] 

['2015-08-20'] 

['판타지'] 

2058096 

['부라더 (The Bros)'] 

['2017-11-02'] 

['코미디'] 

1492903 

['공모자들 (Traffickers)'] 

['2012-08-29'] 

['범죄'] 

1646142 

["임금님의 사건수첩 (The King's Case Note)"] 

['2017-04-26'] 

['코미디'] 

1635003 

['조작된 도시 (Fabricated City)'] 

['2017-02-09'] 

['범죄'] 

2515590 

['겟 아웃 (GET OUT)'] 

['2017-05-17'] 

['공포(호러)'] 

2138524 

['바람과 함께 사라지다 (The Grand Heist)'] 

['2012-08-08'] 

['코미디'] 

4909950 

['이웃사람 (The Neighbors)'] 

['2012-08-22'] 

['스릴러'] 

2434435 

['루시 (LUCY)'] 

['2014-09-03'] 

['액션'] 

1974893 

['곤지암 (GONJIAM: Haunted Asylum)'] 

['2018-03-28'] 

['공포(호러)'] 

2675883 

['램페이지 (Rampage)'] 

['2018-04-12'] 

['액션'] 

1385511 

['어메이징 스파이더맨 (The Amazing Spider - Man)'] 

['2012-06-28'] 

['액션'] 

4853273 

['회사원 (A Company Man)'] 

['2012-10-11'] 

['액션'] 

1110523 

['레미제라블 (Les Miserables)'] 

['2012-12-19'] 

['드라마'] 

5921913 

['협상 (THE NEGOTIATION)'] 

['2018-09-19'] 

['범죄'] 

1967721 

['불한당: 나쁜 놈들의 세상 (The Merciless)'] 

['2017-05-17'] 

['범죄'] 

958498 

['보헤미안 랩소디 (Bohemian Rhapsody)'] 

['2018-10-31'] 

['드라마'] 

9948386 

['치외법권 (Untouchable Lawmen)'] 

['2015-08-27'] 

['액션'] 

346483 

['목격자 (The Witness)'] 

['2018-08-15'] 

['스릴러'] 

2524720 

['그레이의 50가지 그림자 (Fifty Shades of Grey)'] 

['2015-02-26'] 

['드라마'] 

364415 

['앤트맨 (Ant-Man)'] 

['2015-09-03'] 

['액션'] 

2847712 

['드래곤 길들이기 2 (How To Train Your Dragon 2)'] 

['2014-07-23'] 

['애니메이션'] 

3000115 

['굿바이 싱글 (Familyhood)'] 

['2016-06-29'] 

['코미디'] 

2108561 

['엑스맨: 아포칼립스 (X-Men: Apocalypse)'] 

['2016-05-25'] 

['액션'] 

2938818 

['마이펫의 이중생활 (The Secret Life of Pets)'] 

['2016-08-03'] 

['애니메이션'] 

2520700 

['트랜스포머: 사라진 시대 (Transformers : Age of Extinction)'] 

['2014-06-25'] 

['액션'] 

5295836 

["나의 PS 파트너  (Whatcha Wearin')"] 

['2012-12-06'] 

['멜로/로맨스'] 

1831741 

['엑시트 (EXIT)'] 

['2019-07-31'] 

['코미디'] 

9425630 

['컨저링 (The Conjuring)'] 

['2013-09-17'] 

['공포(호러)'] 

2262758 

['토르: 다크 월드 (Thor: The Dark World )'] 

['2013-10-30'] 

['액션'] 

3040115 

['테이큰 3 (Taken 3)'] 

['2015-01-01'] 

['액션'] 

2006561 

['비긴 어게인 (Begin Again)'] 

['2014-08-13'] 

['멜로/로맨스'] 

3445658 

['봉오동 전투 (The Battle: Roar to Victory)'] 

['2019-08-07'] 

['사극'] 

4787227 

['슈퍼배드 3 (Despicable Me 3)'] 

['2017-07-26'] 

['애니메이션'] 

3324874 

['악녀 (The Villainess)'] 

['2017-06-08'] 

['액션'] 

1208081 

['대호 (The Tiger)'] 

['2015-12-16'] 

['사극'] 

1762742 

['명당 (FENGSHUI)'] 

['2018-09-19'] 

['사극'] 

2087474 

['제이슨 본 (Jason Bourne)'] 

['2016-07-27'] 

['액션'] 

2611966 

['간기남 (The Scent)'] 

['2012-04-11'] 

['코미디'] 

1246185 

['어벤져스: 엔드게임 (Avengers: Endgame)'] 

['2019-04-24'] 

['액션'] 

13934592 

['황제를 위하여 (For the Emperor)'] 

['2014-06-11'] 

['액션'] 

592435 

['점쟁이들 (Ghost Sweepers)'] 

['2012-10-03'] 

['코미디'] 

953682 

['스파이 (The Spy: Undercover Operation)'] 

['2013-09-05'] 

['액션'] 

3436092 

['내가 살인범이다 (Confession of Murder)'] 

['2012-11-08'] 

['액션'] 

2729827 

['봉이 김선달 (Seondal: The Man who Sells the River )'] 

['2016-07-06'] 

['사극'] 

2051386 

['화이: 괴물을 삼킨 아이 (Hwayi: A Monster Boy)'] 

['2013-10-09'] 

['액션'] 

2394487 

['더 폰 (The Phone)'] 

['2015-10-22'] 

['스릴러'] 

1593694 

['혹성탈출: 반격의 서막 (Dawn of the Planet of the Apes)'] 

['2014-07-10'] 

['액션'] 

4002560 

['서치 (Searching)'] 

['2018-08-29'] 

['드라마'] 

2950097 

['혹성탈출: 종의 전쟁 (WAR FOR THE PLANET OF THE APES)'] 

['2017-08-15'] 

['액션'] 

2051315 

['조선명탐정 : 사라진 놉의 딸 (Detective K : Secret of the Lost Island)'] 

['2015-02-11'] 

['사극'] 

3872015 

['노무현입니다 (OUR PRESIDENT)'] 

['2017-05-25'] 

['다큐멘터리'] 

1855515 

['타워 (The Tower)'] 

['2012-12-25'] 

['드라마'] 

5181244 

['해리포터와 비밀의 방 (Harry Potter And The Chamber Of Secrets)'] 

['2002-12-13'] 

['드라마'] 

137788 

['테이큰 2 (Taken 2)'] 

['2012-09-27'] 

['액션'] 

2308646 

["킬러의 보디가드 (The Hitman's Bodyguard)"] 

['2017-08-30'] 

['액션'] 

1722017 

['엑스맨: 데이즈 오브 퓨처 패스트 (X-Men: Days of Future Past)'] 

['2014-05-22'] 

['액션'] 

4313871 

['나우 유 씨 미 2 (Now You See Me 2)'] 

['2016-07-13'] 

['범죄'] 

3100113 

['아이 캔 스피크 (I Can Speak )'] 

['2017-09-21'] 

['코미디'] 

3283434 

['지.아이.조 2 (G.I. Joe 2: Retaliation)'] 

['2013-03-28'] 

['액션'] 

1855917 

['미녀와 야수 (Beauty and the Beast)'] 

['2017-03-16'] 

['멜로/로맨스'] 

5138328 

['레버넌트: 죽음에서 돌아온 자 (The Revenant)'] 

['2016-01-14'] 

['어드벤처'] 

2007665 

['퓨리 (Fury)'] 

['2014-11-20'] 

['액션'] 

1362114 

['콩: 스컬 아일랜드 (Kong: Skull Island)'] 

['2017-03-08'] 

['액션'] 

1689717 

['몽타주 (Montage)'] 

['2013-05-16'] 

['스릴러'] 

2095592 

['잭 리처: 네버 고 백 (Jack Reacher: Never Go Back)'] 

['2016-11-30'] 

['액션'] 

612328 

['배틀쉽 (Battleship)'] 

['2012-04-11'] 

['SF'] 

2241687 

['악의 연대기 (The Chronicles of Evil)'] 

['2015-05-14'] 

['스릴러'] 

2192525 

['조선명탐정: 흡혈괴마의 비밀 (Detective K: Secret of the Living Dead)'] 

['2018-02-08'] 

['사극'] 

2444136 

['너의 이름은. (your name.)'] 

['2017-01-04'] 

['애니메이션'] 

3715089 

['원더 우먼 (Wonder Woman)'] 

['2017-05-31'] 

['액션'] 

2165401 

['앤트맨과 와스프 (Ant-Man and the Wasp)'] 

['2018-07-04'] 

['액션'] 

5448134 

['표적 (The Target)'] 

['2014-04-30'] 

['액션'] 

2841884 

['차이나타운 (Coin Locker Girl)'] 

['2015-04-29'] 

['범죄'] 

1472147 

['트랜스포머: 최후의 기사 (TRANSFORMERS: THE LAST KNIGHT)'] 

['2017-06-21'] 

['액션'] 

2614601 

['댄싱퀸 (Dancing Queen)'] 

['2012-01-18'] 

['코미디'] 

4058225 

['원더풀 고스트 (THE SOUL-MATE)'] 

['2018-09-26'] 

['코미디'] 

450378 

['니모를 찾아서 (Finding Nemo)'] 

['2003-06-05'] 

['애니메이션'] 

73483 

['몬스터 호텔 2 (Hotel Transylvania 2)'] 

['2015-12-24'] 

['애니메이션'] 

1515104 

['매드 맥스: 분노의 도로 (Mad Max: Fury Road)'] 

['2015-05-14'] 

['액션'] 

3884130 

['피끓는 청춘 (Hot Young Bloods)'] 

['2014-01-22'] 

['코미디'] 

1676040 

["미스 페레그린과 이상한 아이들의 집 (Miss Peregrine's Home For Peculiar Children)"] 

['2016-09-28'] 

['미스터리'] 

2718158 

['반창꼬 (Love 911)'] 

['2012-12-19'] 

['멜로/로맨스'] 

2475797 

['화차 (Helpless)'] 

['2012-03-08'] 

['미스터리'] 

2436884 

['가문의 영광5 - 가문의 귀환 (Return of the Mafia)'] 

['2012-12-19'] 

['코미디'] 

1160021 

['창궐 (Rampant)'] 

['2018-10-25'] 

['사극'] 

1599598 

['지오스톰 (Geostorm)'] 

['2017-10-19'] 

['액션'] 

1028384 

['로건 (Logan)'] 

['2017-03-01'] 

['액션'] 

2169109 

['라푼젤 (Tangled)'] 

['2011-02-10'] 

['애니메이션'] 

1015392 

['수어사이드 스쿼드 (Suicide Squad)'] 

['2016-08-03'] 

['액션'] 

1898220 

['존 윅 - 리로드 (John Wick Chapter Two)'] 

['2017-02-22'] 

['액션'] 

277370 

['악질경찰 (Jo Pil-ho: The Dawning Rage)'] 

['2019-03-20'] 

['범죄'] 

262233 

['간첩 (The Spies)'] 

['2012-09-20'] 

['드라마'] 

1310895 

['메이즈 러너: 데스 큐어 (Maze Runner: The Death Cure)'] 

['2018-01-17'] 

['액션'] 

2299732 

['고령화 가족 (Boomerang Family)'] 

['2013-05-09'] 

['드라마'] 

1141222 

['몬스터 호텔 (HOTEL TRANSYLVANIA)'] 

['2013-01-17'] 

['애니메이션'] 

884988 

['뽀로로의 대모험 (Pororo To The Cookie Castle)'] 

[' '] 

['애니메이션'] 

0 

['캡틴 아메리카: 윈터 솔져 (Captain America: The Winter Soldier)'] 

['2014-03-26'] 

['액션'] 

3963964 

['성난 변호사 (The Advocate : A Missing Body)'] 

['2015-10-08'] 

['범죄'] 

1128288 

['굿 다이노 (The Good Dinosaur)'] 

['2016-01-07'] 

['애니메이션'] 

1330183 

['다크 나이트 라이즈 (The Dark Knight Rises)'] 

['2012-07-19'] 

['액션'] 

6399303 

['스물 (Twenty)'] 

['2015-03-25'] 

['코미디'] 

3044859 

['캡틴 마블 (Captain Marvel)'] 

['2019-03-06'] 

['액션'] 

5802811 

['도리를 찾아서 (Finding Dory)'] 

['2016-07-06'] 

['애니메이션'] 

2601761 

['어메이징 스파이더맨 2 (The Amazing Spider-Man 2)'] 

['2014-04-23'] 

['액션'] 

4168353 

['26년 (26 Years)'] 

['2012-11-29'] 

['액션'] 

2963652 

['헝거게임: 캣칭 파이어 (The Hunger Games: Catching Fire)'] 

['2013-11-21'] 

['판타지'] 

1127373 

["님아, 그 강을 건너지 마오 (My Love, Don't Cross That River)"] 

['2014-11-27'] 

['다큐멘터리'] 

4802416 

['인셉션 (Inception)'] 

['2010-07-21'] 

['드라마'] 

5835017 

['메리다와 마법의 숲 (Brave)'] 

['2012-09-27'] 

['애니메이션'] 

1231261 

['레지던트 이블 5 : 최후의 심판 (Resident Evil: Retribution)'] 

['2012-09-13'] 

['액션'] 

558443 

['도가니 (Silenced)'] 

['2011-09-22'] 

['드라마'] 

4662926 

['증인 (Innocent Witness)'] 

['2019-02-13'] 

['드라마'] 

2534748 

['짱구는 못말려 극장판: 태풍을 부르는 황금스파이 대작전 (Crayon Shin-chan: The Storm Called: Operation Golden Spy)'] 

['2012-04-26'] 

['애니메이션'] 

272062 

['인디펜던스 데이 : 리써전스 (Independence Day: Resurgence)'] 

['2016-06-22'] 

['액션'] 

1500830 

['소원 (Hope)'] 

['2013-10-02'] 

['드라마'] 

2711094 

['극장판 파워레인저: 캡틴포스 VS 미라클포스 199 히어로 대결전  (Pawer Rangers: Captain Force VS Miracle Force)'] 

['2012-12-13'] 

['애니메이션'] 

110771 

['분노의 질주: 더 맥시멈 (The Fast and the Furious 6)'] 

['2013-05-22'] 

['액션'] 

1790916 

['엣지 오브 투모로우 (Edge of Tomorrow)'] 

['2014-06-04'] 

['액션'] 

4699307 

['씽 (Sing)'] 

['2016-12-21'] 

['애니메이션'] 

1730773 

['몬스터 대학교 (Monsters University)'] 

['2013-09-12'] 

['애니메이션'] 

870759 

['위대한 쇼맨 (The Greatest Showman)'] 

['2017-12-20'] 

['드라마'] 

1403019 

['나를 찾아줘 (Gone Girl)'] 

['2014-10-23'] 

['스릴러'] 

1764233 

['신들의 전쟁 (Immortals)'] 

['2011-11-10'] 

['드라마'] 

1338411 

['워크래프트: 전쟁의 서막 (Warcraft)'] 

['2016-06-09'] 

['액션'] 

1163274 

['살인자의 기억법 (MEMOIR OF A MURDERER)'] 

['2017-09-06'] 

['범죄'] 

2658589 

['방자전 (The Servant)'] 

['2010-06-02'] 

['사극'] 

2985556 

['해리포터와 아즈카반의 죄수 (Harry Potter And The Prisoner Of Azkaban)'] 

['2004-07-16'] 

['드라마'] 

1775033 

['에이리언: 커버넌트 (Alien: Covenant)'] 

['2017-05-09'] 

['SF'] 

1307226 

['강남 1970 (Gangnam Blues)'] 

['2015-01-21'] 

['액션'] 

2192276 

['주먹왕 랄프 (Wreck-It Ralph)'] 

['2012-12-19'] 

['애니메이션'] 

919202 

['상류사회 (High Society)'] 

['2018-08-29'] 

['드라마'] 

768442 

['더 이퀄라이저 2 (The Equalizer 2)'] 

[' '] 

['액션'] 

0 

['인크레더블 2 (INCREDIBLES 2)'] 

['2018-07-18'] 

['애니메이션'] 

3033105 

['해리포터와 불의 잔 (Harry Potter And The Goblet Of Fire)'] 

['2005-12-01'] 

['판타지'] 

3430975 

['대립군 (WARRIORS OF THE DAWN)'] 

['2017-05-31'] 

['드라마'] 

837500 

['용의자X (Perfect Number)'] 

['2012-10-18'] 

['미스터리'] 

1552055 

['나는 왕이로소이다 (I am the King)'] 

['2012-08-08'] 

['사극'] 

790181 

['바람 (Wish)'] 

['2009-11-26'] 

['드라마'] 

103628 

['리얼 스틸 (Real Steel)'] 

['2011-10-12'] 

['액션'] 

3579666 

['말모이 (MAL·MO·E: The Secret Mission)'] 

['2019-01-09'] 

['드라마'] 

2866453 

['레디 플레이어 원 (Ready Player One)'] 

['2018-03-28'] 

['액션'] 

2254430 

['완벽한 파트너-감독판'] 

['2011-12-01'] 

['코미디'] 

844 

['저스티스 리그 (Justice League)'] 

['2017-11-15'] 

['액션'] 

1786386 

['전망 좋은 집 (A House with a View)'] 

['2012-10-25'] 

['멜로/로맨스'] 

1461 

['애프터 어스 (After Earth)'] 

['2013-05-30'] 

['SF'] 

537920 

['12 솔져스 (12 Strong)'] 

['2018-01-31'] 

['액션'] 

223740 

FINISHED
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
>>> 
